using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace DataLayer.Migrations
{
    /// <inheritdoc />
    public partial class AddProductsData : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 1,
                column: "Carbs",
                value: 50.0);

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 2,
                column: "Carbs",
                value: 1590.0);

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 3,
                columns: new[] { "Calories", "Carbs" },
                values: new object[] { 66.0, 450.0 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 4,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 78.0, 400.0, "Алкоголь", 0.0, "Вино белое 12.5% алкоголя", 0.0 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 5,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 98.0, 230.0, "Алкоголь", 0.0, "Вино белое сладкое 12% алкоголя", 0.0 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 6,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 98.0, 590.0, "Алкоголь", 0.0, "Вино белое сладкое 13.5%алкоголя", 0.0 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 7,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 66.0, 230.0, "Алкоголь", 0.0, "Вино белое сухое 12% алкоголя", 0.0 });

            migrationBuilder.InsertData(
                table: "Products",
                columns: new[] { "Id", "Calories", "Carbs", "CategoryName", "Fats", "Gramms", "Name", "Protein", "State" },
                values: new object[,]
                {
                    { 8, 76.0, 230.0, "Алкоголь", 0.0, 100.0, "Вино красное 12% алкоголя", 0.0, false },
                    { 9, 220.0, 0.0, "Алкоголь", 0.0, 100.0, "Виски 40% алкоголя", 0.0, false },
                    { 10, 235.0, 10.0, "Алкоголь", 0.0, 100.0, "Водка 40% алкоголя", 0.0, false },
                    { 11, 220.0, 0.0, "Алкоголь", 0.0, 100.0, "Джин 40% алкоголя", 0.0, false },
                    { 12, 239.0, 7000.0, "Алкоголь", 0.0, 100.0, "Коньяк 40%", 0.0, false },
                    { 13, 345.0, 5300.0, "Алкоголь", 0.0, 100.0, "Ликер 24% алкоголя", 0.0, false },
                    { 14, 139.0, 1000.0, "Алкоголь", 0.0, 100.0, "Мадера 18% алкоголя", 0.0, false },
                    { 15, 29.0, 430.0, "Алкоголь", 0.0, 100.0, "Пиво 1.8% алкоголя", 20.0, false },
                    { 16, 34.0, 440.0, "Алкоголь", 0.0, 100.0, "Пиво 2.8% алкоголя", 40.0, false },
                    { 17, 448.0, 1060.0, "Алкоголь", 0.0, 100.0, "Пиво 4.5% алкоголя", 60.0, false },
                    { 18, 45.0, 380.0, "Алкоголь", 0.0, 100.0, "Пиво 4.5% алкоголя", 60.0, false },
                    { 19, 167.0, 1370.0, "Алкоголь", 0.0, 100.0, "Портвейн 20%алкоголя", 0.0, false },
                    { 20, 260.0, 3000.0, "Алкоголь", 0.0, 100.0, "Пунш 26% алкоголя", 0.0, false },
                    { 21, 220.0, 0.0, "Алкоголь", 0.0, 100.0, "Ром 40% алкоголя", 0.0, false },
                    { 22, 152.0, 1000.0, "Алкоголь", 0.0, 100.0, "Шерри 20% алкоголя", 0.0, false },
                    { 23, 223.0, 2320.0, "Готовые блюда", 1000.0, 100.0, "Беляши", 1100.0, false },
                    { 24, 640.0, 5520.0, "Готовые блюда", 3310.0, 100.0, "Блинчики с творогом и сметаной", 2580.0, false },
                    { 25, 92.0, 780.0, "Готовые блюда", 600.0, 100.0, "Винегрет", 130.0, false },
                    { 26, 52.0, 630.0, "Готовые блюда", 170.0, 100.0, "Окрошка мясная (с квасом)", 210.0, false },
                    { 27, 47.0, 430.0, "Готовые блюда", 190.0, 100.0, "Окрошка на кефире", 310.0, false },
                    { 28, 224.0, 1450.0, "Готовые блюда", 1400.0, 100.0, "Пельмени отварные", 1000.0, false },
                    { 29, 284.0, 4120.0, "Готовые блюда", 750.0, 100.0, "Пирог с мясом", 1320.0, false },
                    { 30, 264.0, 2620.0, "Готовые блюда", 1350.0, 100.0, "Чебуреки", 890.0, false },
                    { 31, 338.0, 1020.0, "Готовые блюда", 2510.0, 100.0, "Шницель", 1760.0, false },
                    { 32, 404.0, 980.0, "Готовые блюда", 3210.0, 100.0, "Шницель свиной", 1880.0, false },
                    { 33, 23.0, 110.0, "Грибы", 170.0, 100.0, "Белые грибы", 370.0, false },
                    { 34, 152.0, 760.0, "Грибы", 480.0, 100.0, "Белые грибы сушеные", 2010.0, false },
                    { 35, 25.0, 110.0, "Грибы", 100.0, 100.0, "Грибы ассорти \"Грибное лукошко\"", 290.0, false },
                    { 36, 16.0, 50.0, "Грибы", 80.0, 100.0, "Грузди", 180.0, false },
                    { 37, 20.0, 150.0, "Грибы", 110.0, 100.0, "Лисички", 160.0, false },
                    { 38, 9.0, 50.0, "Грибы", 70.0, 100.0, "Маслята", 240.0, false },
                    { 39, 17.0, 50.0, "Грибы", 120.0, 100.0, "Опята", 220.0, false },
                    { 40, 23.0, 140.0, "Грибы", 90.0, 100.0, "Подберезовики", 230.0, false },
                    { 41, 231.0, 1430.0, "Грибы", 920.0, 100.0, "Подберезовики сушеные", 2350.0, false },
                    { 42, 22.0, 120.0, "Грибы", 50.0, 100.0, "Подосиновики", 330.0, false },
                    { 43, 239.0, 1290.0, "Грибы", 540.0, 100.0, "Подосиновики сушеные", 3540.0, false },
                    { 44, 17.0, 50.0, "Грибы", 80.0, 100.0, "Рыжики", 190.0, false },
                    { 45, 16.0, 20.0, "Грибы", 40.0, 100.0, "Сморчки", 290.0, false },
                    { 46, 15.0, 150.0, "Грибы", 70.0, 100.0, "Сыроежки", 170.0, false },
                    { 47, 34.0, 380.0, "Грибы", 20.0, 100.0, "Шампиньоны", 280.0, false },
                    { 48, 305.0, 5010.0, "Каши, крупы", 620.0, 100.0, "Геркулес", 1100.0, false },
                    { 49, 298.0, 4860.0, "Каши, крупы", 200.0, 100.0, "Горох сушеный", 2050.0, false },
                    { 50, 340.0, 6750.0, "Каши, крупы", 170.0, 100.0, "Гречневая каша (Myllyn Paras)", 1300.0, false },
                    { 51, 347.0, 6500.0, "Каши, крупы", 330.0, 100.0, "Гречневая крупа Мистраль", 1360.0, false },
                    { 52, 329.0, 6590.0, "Каши, крупы", 230.0, 100.0, "Гречневая продел", 950.0, false },
                    { 53, 335.0, 6210.0, "Каши, крупы", 330.0, 100.0, "Гречневая ядрица", 1260.0, false },
                    { 54, 105.0, 1420.0, "Каши, крупы", 430.0, 100.0, "Каша геркулесовая молочная", 320.0, false },
                    { 55, 84.0, 1480.0, "Каши, крупы", 140.0, 100.0, "Каша геркулесовая на воде", 290.0, false },
                    { 56, 90.0, 1710.0, "Каши, крупы", 80.0, 100.0, "Каша гречневая вязкая на воде", 320.0, false },
                    { 57, 163.0, 3060.0, "Каши, крупы", 160.0, 100.0, "Каша гречневая рассыпчатая", 590.0, false },
                    { 58, 98.0, 1530.0, "Каши, крупы", 320.0, 100.0, "Каша манная молочная", 300.0, false },
                    { 59, 80.0, 1680.0, "Каши, крупы", 20.0, 100.0, "Каша манная на воде", 250.0, false },
                    { 60, 102.0, 1420.0, "Каши, крупы", 410.0, 100.0, "Каша овсяная молочная", 320.0, false },
                    { 61, 88.0, 1500.0, "Каши, крупы", 170.0, 100.0, "Каша овсяная на воде", 300.0, false },
                    { 62, 106.0, 2300.0, "Каши, крупы", 40.0, 100.0, "Каша перловая рассыпчатая", 310.0, false },
                    { 63, 92.0, 1870.0, "Каши, крупы", 30.0, 100.0, "Каша пшеничная вязкая на воде", 320.0, false },
                    { 64, 137.0, 2770.0, "Каши, крупы", 40.0, 100.0, "Каша пшеничная рассыпчатая", 500.0, false },
                    { 65, 90.0, 1700.0, "Каши, крупы", 70.0, 100.0, "Каша пшенная вязкая на воде", 300.0, false },
                    { 66, 135.0, 2610.0, "Каши, крупы", 110.0, 100.0, "Каша пшенная рассыпчатая", 470.0, false },
                    { 67, 97.0, 1600.0, "Каши, крупы", 310.0, 100.0, "Каша рисовая молочная", 250.0, false },
                    { 68, 78.0, 1740.0, "Каши, крупы", 10.0, 100.0, "Каша рисовая на воде", 150.0, false },
                    { 69, 76.0, 1570.0, "Каши, крупы", 30.0, 100.0, "Каша ячневая вязкая на воде", 230.0, false },
                    { 70, 108.0, 2210.0, "Каши, крупы", 40.0, 100.0, "Каша ячневая рассыпчатая", 340.0, false },
                    { 71, 331.0, 6510.0, "Каши, крупы", 440.0, 100.0, "Коричневый рис", 630.0, false },
                    { 72, 337.0, 7160.0, "Каши, крупы", 120.0, 100.0, "Крупа кукурузная", 830.0, false },
                    { 73, 328.0, 6770.0, "Каши, крупы", 100.0, 100.0, "Крупа манная", 1030.0, false },
                    { 74, 320.0, 6650.0, "Каши, крупы", 110.0, 100.0, "Крупа перловая", 930.0, false },
                    { 75, 72.0, 1460.0, "Каши, крупы", 50.0, 100.0, "Кукуруза дробленая", 240.0, false },
                    { 76, 58.0, 1120.0, "Каши, крупы", 40.0, 100.0, "Кукуруза целыми зернами", 220.0, false },
                    { 77, 103.0, 0.0, "Каши, крупы", 80.0, 100.0, "Кукурузные зерна", 300.0, false },
                    { 78, 309.0, 4640.0, "Каши, крупы", 430.0, 100.0, "Нут сушеный", 2010.0, false },
                    { 79, 303.0, 4970.0, "Каши, крупы", 610.0, 100.0, "Овсяная крупа", 1100.0, false },
                    { 80, 325.0, 6250.0, "Каши, крупы", 200.0, 100.0, "Пшеничная каша (Myllyn Paras)", 1300.0, false },
                    { 81, 305.0, 5530.0, "Каши, крупы", 390.0, 100.0, "Пшенная каша (Myllyn Paras)", 1120.0, false },
                    { 82, 348.0, 6650.0, "Каши, крупы", 330.0, 100.0, "Пшено", 1150.0, false },
                    { 83, 331.0, 6510.0, "Каши, крупы", 440.0, 100.0, "Рис коричневый", 630.0, false },
                    { 84, 330.0, 7140.0, "Каши, крупы", 100.0, 100.0, "Рис полированный", 700.0, false },
                    { 85, 113.0, 2490.0, "Каши, крупы", 20.0, 100.0, "Рис рассыпчатый (т.е. вареный)", 240.0, false },
                    { 86, 349.0, 7200.0, "Каши, крупы", 50.0, 100.0, "Рис черный Мистраль", 1400.0, false },
                    { 87, 321.0, 7130.0, "Каши, крупы", 145.0, 100.0, "Хлопья ржаные, ячменные", 1015.0, false },
                    { 88, 3176.0, 6140.0, "Каши, крупы", 280.0, 100.0, "Четырехзерновая каша (Myllyn Paras)", 1170.0, false },
                    { 89, 110.0, 2010.0, "Каши, крупы", 0.0, 100.0, "Чечевица вареная", 780.0, false },
                    { 90, 2851.0, 4440.0, "Каши, крупы", 110.0, 100.0, "Чечевица красная (Muller's Muhle)", 2440.0, false },
                    { 91, 324.0, 6630.0, "Каши, крупы", 130.0, 100.0, "Ячневая крупа", 1000.0, false },
                    { 92, 275.0, 4120.0, "Каши, крупы", 340.0, 100.0, "турецкий горох (Muller's Muhle)", 1980.0, false },
                    { 93, 170.0, 3214.0, "Каши, крупы", 52.0, 100.0, "фасоль белая в том. соусе (бондюэль)", 1047.0, false },
                    { 94, 298.0, 4900.0, "Каши, крупы", 200.0, 100.0, "фасоль сушеная", 2100.0, false },
                    { 95, 423.0, 0.0, "Колбаса", 4020.0, 100.0, "Колбаса армавирская", 1520.0, false },
                    { 96, 170.0, 0.0, "Колбаса", 1350.0, 100.0, "Колбаса диетическая", 1210.0, false },
                    { 97, 187.0, 250.0, "Колбаса", 1390.0, 100.0, "Колбаса для завтрака", 1300.0, false },
                    { 98, 257.0, 150.0, "Колбаса", 2220.0, 100.0, "Колбаса докторская", 1280.0, false },
                    { 99, 366.0, 230.0, "Колбаса", 3300.0, 100.0, "Колбаса закусочная", 1500.0, false },
                    { 100, 608.0, 0.0, "Колбаса", 6320.0, 100.0, "Колбаса зернистая", 990.0, false },
                    { 101, 466.0, 0.0, "Колбаса", 4460.0, 100.0, "Колбаса краковская", 1620.0, false },
                    { 102, 448.0, 0.0, "Колбаса", 4560.0, 100.0, "Колбаса кубанская", 950.0, false },
                    { 103, 301.0, 0.0, "Колбаса", 2800.0, 100.0, "Колбаса любительская", 1220.0, false },
                    { 104, 467.0, 0.0, "Колбаса", 4140.0, 100.0, "Колбаса майкопская", 2360.0, false },
                    { 105, 287.0, 270.0, "Колбаса", 2300.0, 100.0, "Колбаса минская", 1740.0, false },
                    { 106, 252.0, 0.0, "Колбаса", 2280.0, 100.0, "Колбаса молочная", 1170.0, false },
                    { 107, 250.0, 200.0, "Колбаса", 2180.0, 100.0, "Колбаса московская", 1150.0, false },
                    { 108, 402.0, 0.0, "Колбаса", 3810.0, 100.0, "Колбаса одесская", 1480.0, false },
                    { 109, 240.0, 180.0, "Колбаса", 2100.0, 100.0, "Колбаса отдельная", 1100.0, false },
                    { 110, 417.0, 0.0, "Колбаса", 3900.0, 100.0, "Колбаса полтавская", 1640.0, false },
                    { 111, 227.0, 0.0, "Колбаса", 1940.0, 100.0, "Колбаса прима", 1300.0, false },
                    { 112, 302.0, 0.0, "Колбаса", 2890.0, 100.0, "Колбаса русская", 1180.0, false },
                    { 113, 485.0, 190.0, "Колбаса", 4500.0, 100.0, "Колбаса салями", 1930.0, false },
                    { 114, 274.0, 190.0, "Колбаса", 2510.0, 100.0, "Колбаса свиная", 1020.0, false },
                    { 115, 425.0, 0.0, "Колбаса", 4010.0, 100.0, "Колбаса сервелат", 1610.0, false },
                    { 116, 515.0, 0.0, "Колбаса", 4700.0, 100.0, "Колбаса советская", 2300.0, false },
                    { 117, 237.0, 290.0, "Колбаса", 2010.0, 100.0, "Колбаса степная", 1110.0, false },
                    { 118, 319.0, 0.0, "Колбаса", 2870.0, 100.0, "Колбаса столичная", 1510.0, false },
                    { 119, 234.0, 190.0, "Колбаса", 2020.0, 100.0, "Колбаса столовая", 1110.0, false },
                    { 120, 373.0, 0.0, "Колбаса", 3380.0, 100.0, "Колбаса таллиннская", 1710.0, false },
                    { 121, 376.0, 0.0, "Колбаса", 3440.0, 100.0, "Колбаса украинская", 1650.0, false },
                    { 122, 216.0, 190.0, "Колбаса", 1840.0, 100.0, "Колбаса чайная", 1170.0, false },
                    { 123, 215.0, 250.0, "Колбаса", 1730.0, 100.0, "Колбаса южная", 1240.0, false },
                    { 124, 463.0, 0.0, "Колбаса", 4000.0, 100.0, "Охотничьи колбаски", 2570.0, false },
                    { 125, 215.0, 150.0, "Колбаса", 1820.0, 100.0, "Сардельки говяжьи", 1140.0, false },
                    { 126, 332.0, 190.0, "Колбаса", 3160.0, 100.0, "Сардельки свиные", 1010.0, false },
                    { 127, 226.0, 80.0, "Колбаса", 2010.0, 100.0, "Сосиски говяжьи", 1040.0, false },
                    { 128, 304.0, 70.0, "Колбаса", 2950.0, 100.0, "Сосиски любительские", 900.0, false },
                    { 129, 266.0, 160.0, "Колбаса", 2390.0, 100.0, "Сосиски молочные", 1100.0, false },
                    { 130, 270.0, 0.0, "Колбаса", 2470.0, 100.0, "Сосиски особые", 1180.0, false },
                    { 131, 243.0, 0.0, "Колбаса", 2200.0, 100.0, "Сосиски русские", 1130.0, false },
                    { 132, 85.0, 2100.0, "Компоты", 0.0, 100.0, "Компот из абрикосов", 50.0, false },
                    { 133, 79.0, 2000.0, "Компоты", 0.0, 100.0, "Компот из айвы", 40.0, false },
                    { 134, 77.0, 1970.0, "Компоты", 0.0, 100.0, "Компот из винограда", 50.0, false },
                    { 135, 99.0, 2450.0, "Компоты", 0.0, 100.0, "Компот из вишни", 60.0, false },
                    { 136, 99.0, 2450.0, "Компоты", 0.0, 100.0, "Компот из вишни", 60.0, false },
                    { 137, 69.0, 1810.0, "Компоты", 0.0, 100.0, "Компот из мандаринов", 10.0, false },
                    { 138, 78.0, 1990.0, "Компоты", 0.0, 100.0, "Компот из персиков", 50.0, false },
                    { 139, 96.0, 2390.0, "Компоты", 0.0, 100.0, "Компот из слив", 50.0, false },
                    { 140, 78.0, 1990.0, "Компоты", 0.0, 100.0, "Компот из черешни", 50.0, false },
                    { 141, 85.0, 2210.0, "Компоты", 0.0, 100.0, "Компот из яблок", 20.0, false },
                    { 142, 70.0, 1820.0, "Компоты", 0.0, 100.0, "Компот ит груш", 20.0, false },
                    { 143, 897.0, 0.0, "Масла", 9970.0, 100.0, "Жир бараний топленый", 0.0, false },
                    { 144, 897.0, 0.0, "Масла", 9970.0, 100.0, "Жир говяжий топленый", 0.0, false },
                    { 145, 897.0, 0.0, "Масла", 9970.0, 100.0, "Жир свиной (лярд)", 0.0, false },
                    { 146, 743.0, 1740.0, "Масла", 8200.0, 100.0, "Маргарин Молочный", 30.0, false },
                    { 147, 745.0, 0.0, "Масла", 8200.0, 100.0, "Маргарин Славянский", 50.0, false },
                    { 148, 743.0, 2100.0, "Масла", 8200.0, 100.0, "Маргарин Сливочный", 30.0, false },
                    { 149, 653.0, 0.0, "Масла", 7200.0, 100.0, "Маргарин Солнечный", 30.0, false },
                    { 150, 744.0, 2260.0, "Масла", 8200.0, 100.0, "Маргарин Экстра", 50.0, false },
                    { 151, 743.0, 0.0, "Масла", 8200.0, 100.0, "Маргарин Эра", 30.0, false },
                    { 152, 899.0, 0.0, "Масла", 9990.0, 100.0, "Масло арахисовое рафинир.", 0.0, false },
                    { 153, 898.0, 0.0, "Масла", 9980.0, 100.0, "Масло горчичное", 0.0, false },
                    { 154, 898.0, 0.0, "Масла", 9980.0, 100.0, "Масло грецкого ореха", 0.0, false },
                    { 155, 899.0, 0.0, "Масла", 9985.0, 100.0, "Масло конопляное рафинир.", 0.0, false },
                    { 156, 661.0, 0.0, "Масла", 7250.0, 100.0, "Масло крестьянское несоленое", 80.0, false },
                    { 157, 899.0, 0.0, "Масла", 9990.0, 100.0, "Масло кукурузное", 0.0, false },
                    { 158, 898.0, 0.0, "Масла", 9980.0, 100.0, "Масло кунжутное", 0.0, false },
                    { 159, 709.0, 0.0, "Масла", 7800.0, 100.0, "Масло любительское несоленое", 70.0, false },
                    { 160, 898.0, 0.0, "Масла", 9980.0, 100.0, "Масло оливковое", 0.0, false },
                    { 161, 899.0, 0.0, "Масла", 9990.0, 100.0, "Масло подсолнечное", 0.0, false },
                    { 162, 899.0, 0.0, "Масла", 9985.0, 100.0, "Масло рапсовое рафинир.", 0.0, false },
                    { 163, 898.0, 0.0, "Масла", 9980.0, 100.0, "Масло расторопши", 0.0, false },
                    { 164, 898.0, 0.0, "Масла", 9980.0, 100.0, "Масло ростков пшеницы", 0.0, false },
                    { 165, 7436.0, 70.0, "Масла", 8200.0, 100.0, "Масло сливочное", 70.0, false },
                    { 166, 566.0, 0.0, "Масла", 6150.0, 100.0, "Масло сливочное бутербродное", 250.0, false },
                    { 167, 748.0, 0.0, "Масла", 8250.0, 100.0, "Масло сливочное вологодское", 50.0, false },
                    { 168, 748.0, 0.0, "Масла", 8250.0, 100.0, "Масло сливочное несоленое", 50.0, false },
                    { 169, 899.0, 0.0, "Масла", 9990.0, 100.0, "Масло соевое рафинир.", 0.0, false },
                    { 170, 887.0, 0.0, "Масла", 9800.0, 100.0, "Масло топленое", 30.0, false },
                    { 171, 899.0, 0.0, "Масла", 9990.0, 100.0, "Масло хлопковое рафинир.", 0.0, false },
                    { 172, 816.0, 0.0, "Масла", 9000.0, 100.0, "Шпик свиной (без шкурки)", 140.0, false },
                    { 173, 856.0, 0.0, "Масла", 10000.0, 100.0, "рыбий жир в капсулах", 0.0, false },
                    { 174, 57.0, 380.0, "Молочные", 320.0, 100.0, "Ацидофилин", 280.0, false },
                    { 175, 637.0, 1210.0, "Молочные", 90.0, 100.0, "Имунеле NEO (Вимм-Билль-Данн)", 180.0, false },
                    { 176, 85.0, 850.0, "Молочные", 320.0, 100.0, "Иогурт 3.2%-ной жирн. Сладкий", 500.0, false },
                    { 177, 1234.0, 1600.0, "Молочные", 420.0, 100.0, "Йогурт \"Активия\" с черносливом", 540.0, false },
                    { 178, 51.0, 350.0, "Молочные", 150.0, 100.0, "Йогурт 1.5%-нойжирн.", 500.0, false },
                    { 179, 70.0, 850.0, "Молочные", 150.0, 100.0, "Йогурт 1.5%-ный сладкий", 500.0, false },
                    { 180, 66.0, 350.0, "Молочные", 320.0, 100.0, "Йогурт 3.2%-ной жирн.", 500.0, false },
                    { 181, 756.0, 570.0, "Молочные", 320.0, 100.0, "Катык Долголетие", 600.0, false },
                    { 182, 53.0, 390.0, "Молочные", 250.0, 100.0, "Кефир 2.5% жирн.", 290.0, false },
                    { 183, 56.0, 410.0, "Молочные", 320.0, 100.0, "Кефир жирный", 280.0, false },
                    { 184, 30.0, 380.0, "Молочные", 5.0, 100.0, "Кефир нежирный", 300.0, false },
                    { 185, 44.0, 478.0, "Молочные", 150.0, 100.0, "Молоко 1.5%-ной жирн.", 285.0, false },
                    { 186, 52.0, 473.0, "Молочные", 250.0, 100.0, "Молоко 2.5%-ной жирн.", 282.0, false },
                    { 187, 58.0, 470.0, "Молочные", 320.0, 100.0, "Молоко 3.2%-ной жирн.", 280.0, false },
                    { 188, 61.0, 469.0, "Молочные", 350.0, 100.0, "Молоко 3.5%-ной жирн.", 279.0, false },
                    { 189, 84.0, 470.0, "Молочные", 600.0, 100.0, "Молоко 6 %-ной жир.", 300.0, false },
                    { 190, 31.0, 470.0, "Молочные", 5.0, 100.0, "Молоко обезжиренное", 300.0, false },
                    { 191, 140.0, 950.0, "Молочные", 830.0, 100.0, "Молоко сгущ. без сахара", 700.0, false },
                    { 192, 272.0, 5850.0, "Молочные", 50.0, 100.0, "Молоко сгущ. с сахаром нежирное", 1100.0, false },
                    { 193, 415.0, 400.0, "Молочные", 150.0, 100.0, "Молоко соевое 1.5% (ДакгоМЗ)", 300.0, false },
                    { 194, 350.0, 4930.0, "Молочные", 100.0, 100.0, "Молоко сухое обезжиренное", 3790.0, false },
                    { 195, 476.0, 3750.0, "Молочные", 2500.0, 100.0, "Молоко сухое цельное", 2600.0, false },
                    { 196, 40.0, 470.0, "Молочные", 100.0, 100.0, "Пахта", 330.0, false },
                    { 197, 58.0, 410.0, "Молочные", 320.0, 100.0, "Простокваша", 280.0, false },
                    { 198, 84.0, 410.0, "Молочные", 600.0, 100.0, "Ряженка 6 %-ной жирн.", 500.0, false },
                    { 199, 55.0, 420.0, "Молочные", 250.0, 100.0, "Ряженка Останкинская", 320.0, false },
                    { 200, 70.0, 460.0, "Молочные", 400.0, 100.0, "Ряженка Очаковская 4%", 300.0, false },
                    { 201, 70.0, 460.0, "Молочные", 400.0, 100.0, "Ряженка из Простоквашино (Петмол)", 300.0, false },
                    { 202, 118.0, 400.0, "Молочные", 1000.0, 100.0, "Сливки 10 %-ной жир.", 300.0, false },
                    { 203, 206.0, 370.0, "Молочные", 2000.0, 100.0, "Сливки 20 %-ной жир.", 280.0, false },
                    { 204, 337.0, 300.0, "Молочные", 3500.0, 100.0, "Сливки 35 %-ной жир.", 250.0, false },
                    { 205, 115.0, 290.0, "Молочные", 1000.0, 100.0, "Сметана 10 %-ной жир.", 300.0, false },
                    { 206, 206.0, 320.0, "Молочные", 2000.0, 100.0, "Сметана 20 %-ной жир.", 280.0, false },
                    { 207, 248.0, 270.0, "Молочные", 2500.0, 100.0, "Сметана 25 %-ной жир.", 260.0, false },
                    { 208, 294.0, 310.0, "Молочные", 3000.0, 100.0, "Сметана 30 %-ной жир.", 240.0, false },
                    { 209, 372.0, 405.0, "Молочные", 100.0, 100.0, "кефир 33 коровы 1%", 300.0, false },
                    { 210, 372.0, 405.0, "Молочные", 100.0, 100.0, "кефир Пастушок 1%", 300.0, false },
                    { 211, 361.0, 490.0, "Молочные", 50.0, 100.0, "молоко 0.5% ДвД", 300.0, false },
                    { 212, 35.0, 480.0, "Молочные", 50.0, 100.0, "молоко 0.5% Пармалат", 300.0, false },
                    { 213, 447.0, 480.0, "Молочные", 150.0, 100.0, "молоко 1.5% ДвД", 300.0, false },
                    { 214, 623.0, 470.0, "Молочные", 350.0, 100.0, "молоко 3.5% ДвД", 300.0, false },
                    { 215, 1598.0, 360.0, "Молочные", 1500.0, 100.0, "сметана 15% \"Домик в деревне\"", 260.0, false },
                    { 216, 396.0, 250.0, "Молочные", 4200.0, 100.0, "сметана 42% Валио", 200.0, false },
                    { 217, 22.0, 440.0, "Замороженные овощи", 40.0, 100.0, "мор.ов. \"Summer mix\" (Ardo)", 60.0, false },
                    { 218, 28.0, 730.0, "Замороженные овощи", 20.0, 100.0, "мор.ов. \"Борщ украинский\" (Хортино)", 140.0, false },
                    { 219, 29.0, 750.0, "Замороженные овощи", 30.0, 100.0, "мор.ов. \"Весенний овощной букет\" (Хортекс)", 280.0, false },
                    { 220, 33.0, 450.0, "Замороженные овощи", 50.0, 100.0, "мор.ов. \"Весенняя\" (ов.смесь Бондюэль)", 260.0, false },
                    { 221, 22.0, 600.0, "Замороженные овощи", 30.0, 100.0, "мор.ов. \"Грибной\" (Бондюэль)", 30.0, false },
                    { 222, 29.0, 520.0, "Замороженные овощи", 10.0, 100.0, "мор.ов. \"Гювеч\" (4 сезона)", 140.0, false },
                    { 223, 21.0, 550.0, "Замороженные овощи", 20.0, 100.0, "мор.ов. \"Из цветной капусты\" (Хортекс)", 200.0, false },
                    { 224, 26.0, 690.0, "Замороженные овощи", 30.0, 100.0, "мор.ов. \"Итальянский\" (Хортекс)", 180.0, false },
                    { 225, 34.0, 390.0, "Замороженные овощи", 110.0, 100.0, "мор.ов. \"Китайская смесь\" (4 сезона)", 220.0, false },
                    { 226, 284.0, 590.0, "Замороженные овощи", 0.0, 100.0, "мор.ов. \"Кускус\" (Овощной мир)", 120.0, false },
                    { 227, 21.0, 480.0, "Замороженные овощи", 30.0, 100.0, "мор.ов. \"Лечо\" (Хортекс)", 110.0, false },
                    { 228, 38.0, 770.0, "Замороженные овощи", 20.0, 100.0, "мор.ов. \"Лечо\" (Эликом)", 130.0, false },
                    { 229, 25.0, 790.0, "Замороженные овощи", 30.0, 100.0, "мор.ов. \"Овощи для супа\" (Хортино)", 150.0, false },
                    { 230, 38.0, 878.0, "Замороженные овощи", 10.0, 100.0, "мор.ов. \"Овощное рагу\" (4 сезона)", 50.0, false },
                    { 231, 27.0, 720.0, "Замороженные овощи", 20.0, 100.0, "мор.ов. \"Осенний\" (Хортекс)", 160.0, false },
                    { 232, 22.0, 590.0, "Замороженные овощи", 30.0, 100.0, "мор.ов. \"Президентский\" (Хортекс)", 130.0, false },
                    { 233, 275.0, 310.0, "Замороженные овощи", 30.0, 100.0, "фасоль Лоби зеленый (4 сезона)", 310.0, false },
                    { 234, 24.0, 680.0, "Замороженные овощи", 20.0, 100.0, "фасоль желтая мороженая хортино", 220.0, false },
                    { 235, 28.0, 760.0, "Замороженные овощи", 20.0, 100.0, "фасоль целая мороженая (бондюэль)", 190.0, false },
                    { 236, 317.0, 6410.0, "Мучное", 130.0, 100.0, "Баранки простые", 1040.0, false },
                    { 237, 349.0, 5970.0, "Мучное", 800.0, 100.0, "Баранки сдобные", 830.0, false },
                    { 238, 186.0, 3430.0, "Мучное", 310.0, 100.0, "Блины", 510.0, false },
                    { 239, 284.0, 5800.0, "Мучное", 110.0, 100.0, "Бублики", 900.0, false },
                    { 240, 261.0, 5050.0, "Мучное", 250.0, 100.0, "Булка городская", 780.0, false },
                    { 241, 300.0, 5370.0, "Мучное", 530.0, 100.0, "Булочка кунцевская", 820.0, false },
                    { 242, 313.0, 2820.0, "Мучное", 1480.0, 100.0, "Булочки диетические с лецитином", 1620.0, false },
                    { 243, 249.0, 5100.0, "Мучное", 80.0, 100.0, "Калач московский", 790.0, false },
                    { 244, 190.0, 3600.0, "Мучное", 150.0, 100.0, "Лапша японская \"Соба\" из гречн. муки", 700.0, false },
                    { 245, 318.0, 6690.0, "Мучное", 120.0, 100.0, "Макароны \"Топинамбурные\" (МакМастер)", 1080.0, false },
                    { 246, 307.0, 6260.0, "Мучное", 170.0, 100.0, "Макароны \"Целеб\" ржаные", 900.0, false },
                    { 247, 335.0, 6840.0, "Мучное", 130.0, 100.0, "Макароны 1-го сорта", 1070.0, false },
                    { 248, 337.0, 6970.0, "Мучное", 110.0, 100.0, "Макароны высшего сорта", 1040.0, false },
                    { 249, 176.0, 2500.0, "Мучное", 640.0, 100.0, "Макароны жареные", 420.0, false },
                    { 250, 98.0, 1900.0, "Мучное", 40.0, 100.0, "Макароны отварные", 410.0, false },
                    { 251, 345.0, 6800.0, "Мучное", 210.0, 100.0, "Макароны яичные", 1130.0, false },
                    { 252, 59.0, 840.0, "Мучное", 140.0, 100.0, "Молочная лапша", 220.0, false },
                    { 253, 367.0, 7370.0, "Мучное", 120.0, 100.0, "Мука гречневая", 1360.0, false },
                    { 254, 330.0, 7020.0, "Мучное", 150.0, 100.0, "Мука кукурузная (диетическая)", 720.0, false },
                    { 255, 331.0, 6760.0, "Мучное", 130.0, 100.0, "Мука пшеничная 1-го сорта", 1060.0, false },
                    { 256, 324.0, 6370.0, "Мучное", 180.0, 100.0, "Мука пшеничная 2-го сорта", 1170.0, false },
                    { 257, 334.0, 6890.0, "Мучное", 110.0, 100.0, "Мука пшеничная высшего сорта", 1030.0, false },
                    { 258, 298.0, 5680.0, "Мучное", 220.0, 100.0, "Мука пшеничная обойная", 1150.0, false },
                    { 259, 298.0, 6020.0, "Мучное", 170.0, 100.0, "Мука ржаная обдирная", 890.0, false },
                    { 260, 293.0, 5680.0, "Мучное", 190.0, 100.0, "Мука ржаная обойная", 1070.0, false },
                    { 261, 371.0, 8200.0, "Мучное", 60.0, 100.0, "Мука рисовая (диетическая)", 740.0, false },
                    { 262, 225.0, 4000.0, "Мучное", 660.0, 100.0, "Оладьи", 70.0, false },
                    { 263, 380.0, 6920.0, "Мучное", 660.0, 100.0, "Сушки новые", 960.0, false },
                    { 264, 335.0, 6800.0, "Мучное", 130.0, 100.0, "Сушки простые", 1090.0, false },
                    { 265, 244.0, 4800.0, "Мучное", 230.0, 100.0, "Тесто дрожжевое", 680.0, false },
                    { 266, 283.0, 4530.0, "Мучное", 760.0, 100.0, "Тесто дрожжевое сдобное", 750.0, false },
                    { 267, 344.0, 3680.0, "Мучное", 1860.0, 100.0, "Тесто слоеное пресное", 600.0, false },
                    { 268, 306.0, 5020.0, "Мучное", 600.0, 100.0, "Толокно", 1150.0, false },
                    { 269, 390.0, 7000.0, "Мучное", 790.0, 100.0, "Хлебцы Finn Crisp (Sesame)", 1000.0, false },
                    { 270, 3429.0, 6100.0, "Мучное", 610.0, 100.0, "Хлебцы Finn Crisp (Мультизерновые)", 1100.0, false },
                    { 271, 3051.0, 6200.0, "Мучное", 190.0, 100.0, "Хлебцы Finn Crisp (Тмин)", 1000.0, false },
                    { 272, 290.0, 5950.0, "Мучное", 230.0, 100.0, "Хлебцы гречневые (Русская нива)", 1160.0, false },
                    { 273, 3105.0, 5900.0, "Мучное", 250.0, 100.0, "Хлебцы ржаные хрустящие (Хлебный дом)", 1300.0, false },
                    { 274, 243.0, 0.0, "Мясо", 1720.0, 100.0, "Баранина отварная", 2200.0, false },
                    { 275, 233.0, 0.0, "Мясо", 900.0, 100.0, "Бастурма сыровяленная (Останкино)", 3800.0, false },
                    { 276, 145.0, 0.0, "Мясо", 500.0, 100.0, "Бастурма сыровяленная (Черкизовский)", 2500.0, false },
                    { 277, 1224.0, 0.0, "Мясо", 120.0, 100.0, "Бастурма тюркская (Царицыно)", 2790.0, false },
                    { 278, 228.0, 660.0, "Мясо", 1430.0, 100.0, "Бефстроганов", 1800.0, false },
                    { 279, 194.0, 820.0, "Мясо", 1160.0, 100.0, "Биточки паровые", 1400.0, false },
                    { 280, 214.0, 0.0, "Мясо", 1100.0, 100.0, "Бифштекс", 2880.0, false },
                    { 281, 134.0, 0.0, "Мясо", 400.0, 100.0, "Ветчина Индейка европейская (Микоян)", 1200.0, false },
                    { 282, 279.0, 0.0, "Мясо", 2090.0, 100.0, "Ветчина в форме", 2260.0, false },
                    { 283, 75.0, 0.0, "Мясо", 300.0, 100.0, "Ветчина из говядины (Империя вкуса)", 1200.0, false },
                    { 284, 107.0, 0.0, "Мясо", 300.0, 100.0, "Ветчина из говядины запеченая (Империя вкуса)", 2000.0, false },
                    { 285, 912.0, 0.0, "Мясо", 400.0, 100.0, "Ветчина из индейки (Империя вкуса)", 1380.0, false },
                    { 286, 183.0, 0.0, "Мясо", 1370.0, 100.0, "Ветчина любительская", 1490.0, false },
                    { 287, 126.0, 0.0, "Мясо", 620.0, 100.0, "Ветчина особая", 1760.0, false },
                    { 288, 107.0, 0.0, "Мясо", 300.0, 100.0, "Говядина антрекот (МЕТРО)", 2000.0, false },
                    { 289, 199.0, 0.0, "Мясо", 900.0, 100.0, "Говядина вырезка", 2800.0, false },
                    { 290, 123.0, 0.0, "Мясо", 500.0, 100.0, "Говядина вырезка (МЕТРО)", 1900.0, false },
                    { 291, 1404.0, 0.0, "Мясо", 600.0, 100.0, "Говядина копченая (МИКОЯН)", 2160.0, false },
                    { 292, 254.0, 0.0, "Мясо", 1680.0, 100.0, "Говядина отварная", 2580.0, false },
                    { 293, 117.0, 330.0, "Мясо", 530.0, 100.0, "Говядина тушеная", 1430.0, false },
                    { 294, 605.0, 0.0, "Мясо", 6330.0, 100.0, "Грудинка сырокопченая", 890.0, false },
                    { 295, 175.0, 390.0, "Мясо", 1220.0, 100.0, "Гуляш", 1230.0, false },
                    { 296, 192.0, 400.0, "Мясо", 1200.0, 100.0, "Гуляш говяжий", 1710.0, false },
                    { 297, 281.0, 400.0, "Мясо", 2280.0, 100.0, "Гуляш свиной", 1500.0, false },
                    { 298, 176.0, 0.0, "Мясо", 1040.0, 100.0, "Завтрак туриста (говядина)", 2050.0, false },
                    { 299, 206.0, 0.0, "Мясо", 1540.0, 100.0, "Завтрак туриста (свинина)", 1690.0, false },
                    { 300, 226.0, 0.0, "Мясо", 1350.0, 100.0, "Индейка жареная", 2620.0, false },
                    { 301, 195.0, 0.0, "Мясо", 1040.0, 100.0, "Индейка отварная", 2530.0, false },
                    { 302, 1312.0, 0.0, "Мясо", 560.0, 100.0, "Индейка филе (БИБИГОН)", 2020.0, false },
                    { 303, 130.0, 0.0, "Мясо", 670.0, 100.0, "Индейка шницель (Егорьевская п/ф)", 1980.0, false },
                    { 304, 469.0, 0.0, "Мясо", 4740.0, 100.0, "Корейка сырокопченая", 1050.0, false },
                    { 305, 220.0, 1360.0, "Мясо", 1180.0, 100.0, "Котлеты говяжьи", 1460.0, false },
                    { 306, 340.0, 1360.0, "Мясо", 2680.0, 100.0, "Котлеты свиные", 1060.0, false },
                    { 307, 233.0, 0.0, "Мясо", 1480.0, 100.0, "Кролик жареный", 2500.0, false },
                    { 308, 204.0, 0.0, "Мясо", 1170.0, 100.0, "Кролик отварной", 2460.0, false },
                    { 309, 120.0, 0.0, "Мясо", 450.0, 100.0, "Куриная грудка", 1870.0, false },
                    { 310, 1077.0, 0.0, "Мясо", 250.0, 100.0, "Куриная грудка Петелинка", 2130.0, false },
                    { 311, 206.0, 1520.0, "Мясо", 800.0, 100.0, "Куриные котлеты", 1800.0, false },
                    { 312, 204.0, 0.0, "Мясо", 1100.0, 100.0, "Курица жареная", 2630.0, false },
                    { 313, 1188.0, 0.0, "Мясо", 200.0, 100.0, "Курица отварная", 2520.0, false },
                    { 314, 124.0, 0.0, "Мясо", 860.0, 100.0, "Мозги говяжьи", 1170.0, false },
                    { 315, 130.0, 60.0, "Мясо", 640.0, 100.0, "Мышечный желудок кур", 2100.0, false },
                    { 316, 202.0, 380.0, "Мясо", 1280.0, 100.0, "Мясо в белом соусе", 1800.0, false },
                    { 317, 288.0, 0.0, "Мясо", 2560.0, 100.0, "Окорок тамбовский", 1430.0, false },
                    { 318, 195.0, 0.0, "Мясо", 860.0, 100.0, "Окорочка жареные", 2940.0, false },
                    { 319, 317.0, 250.0, "Мясо", 2890.0, 100.0, "Паштет печеночный", 1160.0, false },
                    { 320, 975.0, 0.0, "Мясо", 310.0, 100.0, "Печень говяжья", 1740.0, false },
                    { 321, 140.0, 140.0, "Мясо", 590.0, 100.0, "Печень кур", 2040.0, false },
                    { 322, 109.0, 0.0, "Мясо", 380.0, 100.0, "Печень свиная", 1880.0, false },
                    { 323, 86.0, 0.0, "Мясо", 280.0, 100.0, "Почки говяжьи", 1520.0, false },
                    { 324, 92.0, 0.0, "Мясо", 360.0, 100.0, "Почки свиные", 1500.0, false },
                    { 325, 584.0, 0.0, "Мясо", 6130.0, 100.0, "Свинина жирная", 800.0, false },
                    { 326, 375.0, 0.0, "Мясо", 5160.0, 100.0, "Свинина отварная", 2260.0, false },
                    { 327, 349.0, 0.0, "Мясо", 3220.0, 100.0, "Свинина тушеная", 1490.0, false },
                    { 328, 96.0, 0.0, "Мясо", 350.0, 100.0, "Сердце говяжье", 1600.0, false },
                    { 329, 159.0, 80.0, "Мясо", 1030.0, 100.0, "Сердце кур", 1580.0, false },
                    { 330, 101.0, 0.0, "Мясо", 400.0, 100.0, "Сердце свиное", 1620.0, false },
                    { 331, 60.0, 0.0, "Мясо", 400.0, 100.0, "Студень из говяжьих ножек", 600.0, false },
                    { 332, 266.0, 0.0, "Мясо", 1950.0, 100.0, "Утка жареная", 2260.0, false },
                    { 333, 248.0, 0.0, "Мясо", 1880.0, 100.0, "Утка отварная", 1970.0, false },
                    { 334, 143.0, 0.0, "Мясо", 500.0, 100.0, "Цыплята отварные", 2460.0, false },
                    { 335, 271.0, 20.0, "Мясо", 2100.0, 100.0, "Цыплята табака", 2500.0, false },
                    { 336, 324.0, 0.0, "Мясо", 2310.0, 100.0, "Шашлык из свинины", 2650.0, false },
                    { 337, 366.0, 0.0, "Мясо", 3260.0, 100.0, "Эскалоп", 1800.0, false },
                    { 338, 146.0, 0.0, "Мясо", 1090.0, 100.0, "Язык говяжий", 1220.0, false },
                    { 339, 150.0, 15.0, "Мясо", 860.0, 100.0, "котлеты из говядины с индейкой", 1780.0, false },
                    { 340, 17155.0, 0.0, "Мясо", 365.0, 100.0, "телятина запеченая", 3468.0, false },
                    { 341, 888.0, 0.0, "Мясо", 120.0, 100.0, "телятина, грудная часть", 1950.0, false },
                    { 342, 94.0, 0.0, "Мясо", 200.0, 100.0, "телятина, окорок (Метро)", 1900.0, false },
                    { 343, 1621.0, 410.0, "Овощи", 1530.0, 100.0, "Авокадо", 200.0, false },
                    { 344, 24.0, 510.0, "Овощи", 10.0, 100.0, "Баклажаны", 120.0, false },
                    { 345, 23.0, 800.0, "Овощи", 10.0, 100.0, "Бамия", 20.0, false },
                    { 346, 60.0, 850.0, "Овощи", 10.0, 100.0, "Бобы", 600.0, false },
                    { 347, 34.0, 740.0, "Овощи", 10.0, 100.0, "Брюква", 120.0, false },
                    { 348, 75.0, 1310.0, "Овощи", 20.0, 100.0, "Горошек зеленый", 510.0, false },
                    { 349, 148.0, 509.0, "Овощи", 1330.0, 100.0, "Икра из баклажанов", 170.0, false },
                    { 350, 122.0, 854.0, "Овощи", 900.0, 100.0, "Икра из кабачков", 200.0, false },
                    { 351, 23.0, 490.0, "Овощи", 30.0, 100.0, "Кабачки", 60.0, false },
                    { 352, 88.0, 670.0, "Овощи", 600.0, 100.0, "Кабачки жареные", 110.0, false },
                    { 353, 249.0, 220.0, "Овощи", 50.0, 100.0, "Капуста Романеско (Бондюэль)", 290.0, false },
                    { 354, 27.0, 470.0, "Овощи", 10.0, 100.0, "Капуста белокочанная", 180.0, false },
                    { 355, 49.0, 420.0, "Овощи", 280.0, 100.0, "Капуста белокочанная жареная", 180.0, false },
                    { 356, 21.0, 390.0, "Овощи", 10.0, 100.0, "Капуста белокочанная отварная", 140.0, false },
                    { 357, 75.0, 960.0, "Овощи", 330.0, 100.0, "Капуста белокочанная тушеная", 200.0, false },
                    { 358, 24.0, 470.0, "Овощи", 40.0, 100.0, "Капуста брокколи", 270.0, false },
                    { 359, 34.0, 810.0, "Овощи", 50.0, 100.0, "Капуста брюссельская", 450.0, false },
                    { 360, 35.0, 840.0, "Овощи", 60.0, 100.0, "Капуста брюссельская хортекс", 460.0, false },
                    { 361, 194.0, 300.0, "Овощи", 10.0, 100.0, "Капуста квашеная", 180.0, false },
                    { 362, 42.0, 790.0, "Овощи", 0.0, 100.0, "Капуста кольраби", 280.0, false },
                    { 363, 24.0, 520.0, "Овощи", 0.0, 100.0, "Капуста краснокочанная", 80.0, false },
                    { 364, 16.0, 220.0, "Овощи", 20.0, 100.0, "Капуста пекинская", 120.0, false },
                    { 365, 30.0, 450.0, "Овощи", 30.0, 100.0, "Капуста цветная", 250.0, false },
                    { 366, 26.0, 400.0, "Овощи", 30.0, 100.0, "Капуста цветная отварная", 180.0, false },
                    { 367, 80.0, 1630.0, "Овощи", 40.0, 100.0, "Картофель", 200.0, false },
                    { 368, 192.0, 2340.0, "Овощи", 950.0, 100.0, "Картофель жареный", 280.0, false },
                    { 369, 82.0, 1670.0, "Овощи", 40.0, 100.0, "Картофель отварной", 200.0, false },
                    { 370, 74.0, 1430.0, "Овощи", 80.0, 100.0, "Картофельное пюре", 220.0, false },
                    { 371, 1223.0, 2280.0, "Овощи", 150.0, 100.0, "Кукуруза консерв. (Бондюэль)", 440.0, false },
                    { 372, 19.0, 350.0, "Овощи", 0.0, 100.0, "Лук зеленый (перо)", 130.0, false },
                    { 373, 33.0, 650.0, "Овощи", 0.0, 100.0, "Лук порей", 200.0, false },
                    { 374, 41.0, 910.0, "Овощи", 0.0, 100.0, "Лук репчатый", 140.0, false },
                    { 375, 50.0, 620.0, "Овощи", 10.0, 100.0, "Морковь желт.", 130.0, false },
                    { 376, 34.0, 720.0, "Овощи", 10.0, 100.0, "Морковь красная", 130.0, false },
                    { 377, 29.0, 610.0, "Овощи", 10.0, 100.0, "Морковь отварная", 120.0, false },
                    { 378, 14.0, 260.0, "Овощи", 10.0, 100.0, "Огурцы грунтовые", 80.0, false },
                    { 379, 11.0, 190.0, "Овощи", 10.0, 100.0, "Огурцы парниковые", 70.0, false },
                    { 380, 13.0, 160.0, "Овощи", 10.0, 100.0, "Огурцы соленые", 80.0, false },
                    { 381, 19.0, 410.0, "Овощи", 10.0, 100.0, "Патиссоны", 60.0, false },
                    { 382, 26.0, 530.0, "Овощи", 0.0, 100.0, "Перец зеленый сладкий", 130.0, false },
                    { 383, 27.0, 530.0, "Овощи", 0.0, 100.0, "Перец красный сладкий", 130.0, false },
                    { 384, 27.0, 540.0, "Овощи", 0.0, 100.0, "Перец сладкий мороженный (4 сезона)", 130.0, false },
                    { 385, 49.0, 800.0, "Овощи", 40.0, 100.0, "Петрушка (зелень)", 370.0, false },
                    { 386, 53.0, 1050.0, "Овощи", 60.0, 100.0, "Петрушка (корень)", 150.0, false },
                    { 387, 16.0, 250.0, "Овощи", 10.0, 100.0, "Ревень", 70.0, false },
                    { 388, 35.0, 650.0, "Овощи", 20.0, 100.0, "Редька", 190.0, false },
                    { 389, 345.0, 670.0, "Овощи", 20.0, 100.0, "Редька зеленая", 190.0, false },
                    { 390, 301.0, 620.0, "Овощи", 10.0, 100.0, "Репа", 150.0, false },
                    { 391, 17.0, 230.0, "Овощи", 20.0, 100.0, "Салат", 150.0, false },
                    { 392, 106.0, 80.0, "Овощи", 20.0, 100.0, "Салат кочанный", 140.0, false },
                    { 393, 42.0, 910.0, "Овощи", 10.0, 100.0, "Свекла", 150.0, false },
                    { 394, 31.0, 690.0, "Овощи", 0.0, 100.0, "Свекла натур.", 120.0, false },
                    { 395, 49.0, 1080.0, "Овощи", 0.0, 100.0, "Свекла отварная", 180.0, false },
                    { 396, 399.0, 880.0, "Овощи", 10.0, 100.0, "Свекла сырая", 150.0, false },
                    { 397, 8.0, 200.0, "Овощи", 0.0, 100.0, "Сельдерей (зелень)", 0.0, false },
                    { 398, 32.0, 610.0, "Овощи", 30.0, 100.0, "Сельдерей (корень)", 130.0, false },
                    { 399, 61.0, 1330.0, "Овощи", 0.0, 100.0, "Сладкий картофель", 200.0, false },
                    { 400, 106.0, 710.0, "Овощи", 700.0, 100.0, "Солянка овоще-грибная из свежей капусты", 360.0, false },
                    { 401, 134.0, 660.0, "Овощи", 1050.0, 100.0, "Солянка овощная из квашеной капусты", 330.0, false },
                    { 402, 21.0, 320.0, "Овощи", 10.0, 100.0, "Спаржа", 190.0, false },
                    { 403, 45.0, 830.0, "Овощи", 0.0, 100.0, "Терн", 150.0, false },
                    { 404, 11.0, 230.0, "Овощи", 0.0, 100.0, "Томаты без кожицы", 50.0, false },
                    { 405, 20.0, 380.0, "Овощи", 0.0, 100.0, "Томаты с кожицей", 110.0, false },
                    { 406, 16.0, 160.0, "Овощи", 10.0, 100.0, "Томаты соленые", 110.0, false },
                    { 407, 76.0, 520.0, "Овощи", 550.0, 100.0, "Тыква жареная", 145.0, false },
                    { 408, 31.0, 410.0, "Овощи", 50.0, 100.0, "Укроп", 250.0, false },
                    { 409, 31.0, 300.0, "Овощи", 30.0, 100.0, "Фасоль (стручок)", 300.0, false },
                    { 410, 123.0, 2150.0, "Овощи", 50.0, 100.0, "Фасоль вареная", 780.0, false },
                    { 411, 34.0, 610.0, "Овощи", 10.0, 100.0, "Черемша", 240.0, false },
                    { 412, 46.0, 520.0, "Овощи", 0.0, 100.0, "Чеснок", 650.0, false },
                    { 413, 22.0, 210.0, "Овощи", 20.0, 100.0, "Шпинат", 300.0, false },
                    { 414, 19.0, 300.0, "Овощи", 0.0, 100.0, "Щавель", 150.0, false },
                    { 415, 70.0, 700.0, "Овощи", 400.0, 100.0, "икра баклажаная \"От михалыча\"", 150.0, false },
                    { 416, 193.0, 340.0, "Овощи", 10.0, 100.0, "редис", 120.0, false },
                    { 417, 23.0, 380.0, "Овощи", 20.0, 100.0, "томаты", 110.0, false },
                    { 418, 605.0, 1280.0, "Овощи", 10.0, 100.0, "топинамбур", 210.0, false },
                    { 419, 214.0, 440.0, "Овощи", 10.0, 100.0, "тыква", 100.0, false },
                    { 420, 629.0, 1200.0, "Орехи", 6100.0, 100.0, "Кедровые орешки", 1200.0, false },
                    { 421, 633.0, 1260.0, "Орехи", 5360.0, 100.0, "Кешью", 2520.0, false },
                    { 422, 380.0, 2950.0, "Орехи", 3350.0, 100.0, "Кокосовый орех", 340.0, false },
                    { 423, 5617.0, 1220.0, "Орехи", 4870.0, 100.0, "Кунжутное семя", 1940.0, false },
                    { 424, 649.0, 2050.0, "Орехи", 5770.0, 100.0, "Миндаль", 1860.0, false },
                    { 425, 700.0, 1830.0, "Орехи", 6200.0, 100.0, "Орехи грецкие", 1560.0, false },
                    { 426, 562.0, 2000.0, "Орехи", 4910.0, 100.0, "Орехи кешью жареные с медом и кунжутом", 990.0, false },
                    { 427, 5777.0, 500.0, "Орехи", 5290.0, 100.0, "Семечки подсолнечника", 2070.0, false },
                    { 428, 610.0, 1880.0, "Орехи", 4950.0, 100.0, "Семечки подсолнуха сушеные", 2300.0, false },
                    { 429, 580.0, 1780.0, "Орехи", 4600.0, 100.0, "Семечки тыквы сушеные", 2450.0, false },
                    { 430, 610.0, 2500.0, "Орехи", 4850.0, 100.0, "Фисташки", 2050.0, false },
                    { 431, 642.0, 1640.0, "Орехи", 5160.0, 100.0, "Фисташки жареные соленые", 2080.0, false },
                    { 432, 707.0, 990.0, "Орехи", 6690.0, 100.0, "Фундук", 1610.0, false },
                    { 433, 5713.0, 860.0, "Орехи", 4810.0, 100.0, "арахис", 2600.0, false },
                    { 434, 392.0, 9800.0, "Прочее", 0.0, 100.0, "Ванильный сахар", 0.0, false },
                    { 435, 355.0, 70.0, "Прочее", 40.0, 100.0, "Желатин пищевой", 8720.0, false },
                    { 436, 318.0, 6500.0, "Прочее", 200.0, 100.0, "Зерна пшеницы", 1300.0, false },
                    { 437, 364.0, 2850.0, "Прочее", 1500.0, 100.0, "Какао порошок \"Золотой ярлык\"", 2470.0, false },
                    { 438, 309.0, 2810.0, "Прочее", 1100.0, 100.0, "Какао порошок \"Российский\"", 2440.0, false },
                    { 439, 90.0, 1490.0, "Прочее", 0.0, 100.0, "Кетчуп", 210.0, false },
                    { 440, 202.0, 280.0, "Прочее", 1440.0, 100.0, "Кофе жареный в зернах (сухой)", 1390.0, false },
                    { 441, 1187.0, 700.0, "Прочее", 360.0, 100.0, "Кофе растворимый (сухой)", 1500.0, false },
                    { 442, 312.0, 5300.0, "Прочее", 860.0, 100.0, "Кофе со сгущ. молоком с сахаром", 840.0, false },
                    { 443, 374.0, 4600.0, "Прочее", 1900.0, 100.0, "Кофе со сгущ. сливками. с сахаром", 700.0, false },
                    { 444, 337.0, 7120.0, "Прочее", 480.0, 100.0, "Кофейн.напиток Здоровье (сухой)", 600.0, false },
                    { 445, 627.0, 390.0, "Прочее", 6700.0, 100.0, "Майонез Провансаль", 240.0, false },
                    { 446, 5.0, 0.0, "Прочее", 20.0, 100.0, "Морская капуста", 90.0, false },
                    { 447, 123.0, 130.0, "Прочее", 1270.0, 100.0, "Оливки зеленые маринованные", 140.0, false },
                    { 448, 361.0, 870.0, "Прочее", 3600.0, 100.0, "Оливки черные консервированные", 220.0, false },
                    { 449, 611.0, 5750.0, "Прочее", 3500.0, 100.0, "Сливки сухие Сопью Крима", 220.0, false },
                    { 450, 308.0, 3000.0, "Прочее", 190.0, 100.0, "Соевое мясо", 5330.0, false },
                    { 451, 813.0, 2000.0, "Прочее", 10.0, 100.0, "Соус \"Кетчуп паприкаш\" (Calve)", 10.0, false },
                    { 452, 913.0, 2240.0, "Прочее", 10.0, 100.0, "Соус \"Кисло-сладкий\" для мяса (Calve)", 20.0, false },
                    { 453, 99.0, 2220.0, "Прочее", 0.0, 100.0, "Соус кубанский", 260.0, false },
                    { 454, 98.0, 2180.0, "Прочее", 0.0, 100.0, "Соус томатный острый", 250.0, false },
                    { 455, 77.0, 1940.0, "Прочее", 0.0, 100.0, "Соус яблочный", 40.0, false },
                    { 456, 332.0, 920.0, "Прочее", 1730.0, 100.0, "Соя сушеная", 3490.0, false },
                    { 457, 99.0, 1900.0, "Прочее", 0.0, 100.0, "Томат-паста", 480.0, false },
                    { 458, 65.0, 1180.0, "Прочее", 0.0, 100.0, "Томат-пюре", 360.0, false },
                    { 459, 127.0, 300.0, "Прочее", 500.0, 100.0, "Тофу фитосыр из сои (Флора)", 1700.0, false },
                    { 460, 374.0, 5900.0, "Прочее", 230.0, 100.0, "Фитнес-шейк + Л-карнитин (Мультипауэр)", 3200.0, false },
                    { 461, 396.0, 9900.0, "Прочее", 0.0, 100.0, "Фруктоза", 0.0, false },
                    { 462, 44.0, 760.0, "Прочее", 40.0, 100.0, "Хрен", 250.0, false },
                    { 463, 146.0, 400.0, "Прочее", 510.0, 100.0, "Чай черный байховый (сухой)", 2000.0, false },
                    { 464, 172.0, 480.0, "Прочее", 1640.0, 100.0, "оливки с анчоусом", 120.0, false },
                    { 465, 3475.0, 6060.0, "Прочее", 390.0, 100.0, "отруби \"Здравица\" с бета-каротином", 1750.0, false },
                    { 466, 212.0, 3500.0, "Прочее", 350.0, 100.0, "отруби лимонные", 1500.0, false },
                    { 467, 155.0, 1500.0, "Прочее", 350.0, 100.0, "отруби пшеничные", 1500.0, false },
                    { 468, 155.0, 1500.0, "Прочее", 350.0, 100.0, "отруби ржаные", 1500.0, false },
                    { 469, 212.0, 3500.0, "Прочее", 350.0, 100.0, "отруби с корицей", 1500.0, false },
                    { 470, 212.0, 3500.0, "Прочее", 350.0, 100.0, "отруби с морковью", 1500.0, false },
                    { 471, 196.0, 3000.0, "Прочее", 350.0, 100.0, "отруби с морской капустой", 1500.0, false },
                    { 472, 212.0, 3500.0, "Прочее", 300.0, 100.0, "отруби с топинамбуром", 1400.0, false },
                    { 473, 212.0, 3500.0, "Прочее", 350.0, 100.0, "отруби с яблоком", 1500.0, false },
                    { 474, 212.0, 3500.0, "Прочее", 350.0, 100.0, "отруби со свеклой", 1500.0, false },
                    { 475, 79.0, 1580.0, "Прочее", 0.0, 100.0, "томатная паста Дядя Ваня", 0.0, false },
                    { 476, 194.0, 0.0, "Рыба", 1250.0, 100.0, "Балык осетровый", 2040.0, false },
                    { 477, 234.0, 0.0, "Рыба", 1560.0, 100.0, "Белуга бланшированная", 2330.0, false },
                    { 478, 235.0, 0.0, "Рыба", 550.0, 100.0, "Вобла вяленая", 4640.0, false },
                    { 479, 181.0, 0.0, "Рыба", 630.0, 100.0, "Вобла хол.копч.", 3110.0, false },
                    { 480, 136.0, 0.0, "Рыба", 580.0, 100.0, "Горбуша", 2090.0, false },
                    { 481, 132.0, 690.0, "Рыба", 510.0, 100.0, "Горбуша в томатн.соусе", 1450.0, false },
                    { 482, 168.0, 10.0, "Рыба", 780.0, 100.0, "Горбуша вареная", 2290.0, false },
                    { 483, 169.0, 0.0, "Рыба", 900.0, 100.0, "Горбуша соленая", 2210.0, false },
                    { 484, 114.0, 0.0, "Рыба", 580.0, 100.0, "Зубатка", 1550.0, false },
                    { 485, 237.0, 0.0, "Рыба", 1420.0, 100.0, "Икра белужья зернистая", 2720.0, false },
                    { 486, 230.0, 0.0, "Рыба", 1170.0, 100.0, "Икра горбуши зернистая", 3120.0, false },
                    { 487, 251.0, 0.0, "Рыба", 1380.0, 100.0, "Икра кеты зернистая", 3160.0, false },
                    { 488, 131.0, 0.0, "Рыба", 190.0, 100.0, "Икра минтаевая пробойная", 2840.0, false },
                    { 489, 203.0, 0.0, "Рыба", 970.0, 100.0, "Икра осетровая зернистая", 2890.0, false },
                    { 490, 236.0, 0.0, "Рыба", 1020.0, 100.0, "Икра осетровая паюсная", 3600.0, false },
                    { 491, 221.0, 0.0, "Рыба", 1190.0, 100.0, "Икра севрюжья зернистая", 2840.0, false },
                    { 492, 110.0, 0.0, "Рыба", 420.0, 100.0, "Кальмар", 1800.0, false },
                    { 493, 103.0, 0.0, "Рыба", 330.0, 100.0, "Камбала", 1830.0, false },
                    { 494, 125.0, 630.0, "Рыба", 540.0, 100.0, "Камбала в томатн.соусе", 1260.0, false },
                    { 495, 192.0, 0.0, "Рыба", 1160.0, 100.0, "Камбала гор.копч.", 2200.0, false },
                    { 496, 249.0, 0.0, "Рыба", 2130.0, 100.0, "Камбала обжаренная в масле", 1440.0, false },
                    { 497, 102.0, 0.0, "Рыба", 210.0, 100.0, "Карась", 2070.0, false },
                    { 498, 125.0, 0.0, "Рыба", 530.0, 100.0, "Карп", 1940.0, false },
                    { 499, 129.0, 0.0, "Рыба", 480.0, 100.0, "Кета", 2150.0, false },
                    { 500, 184.0, 0.0, "Рыба", 960.0, 100.0, "Кета соленая", 2430.0, false },
                    { 501, 137.0, 0.0, "Рыба", 760.0, 100.0, "Килька балтийская соленая", 1710.0, false },
                    { 502, 162.0, 0.0, "Рыба", 850.0, 100.0, "Килька гор.копч.", 2130.0, false },
                    { 503, 154.0, 0.0, "Рыба", 1050.0, 100.0, "Килька пряного посола", 1480.0, false },
                    { 504, 96.0, 0.0, "Рыба", 360.0, 100.0, "Краб", 1600.0, false },
                    { 505, 85.0, 10.0, "Рыба", 110.0, 100.0, "Крабы", 1870.0, false },
                    { 506, 103.0, 80.0, "Рыба", 140.0, 100.0, "Креветки", 2180.0, false },
                    { 507, 98.0, 0.0, "Рыба", 170.0, 100.0, "Криль", 2060.0, false },
                    { 508, 126.0, 0.0, "Рыба", 470.0, 100.0, "Лещ", 2090.0, false },
                    { 509, 138.0, 260.0, "Рыба", 740.0, 100.0, "Лещ в томатн.соусе", 1530.0, false },
                    { 510, 221.0, 0.0, "Рыба", 590.0, 100.0, "Лещ вяленый", 4200.0, false },
                    { 511, 172.0, 0.0, "Рыба", 450.0, 100.0, "Лещ гор.копч.", 3280.0, false },
                    { 512, 160.0, 0.0, "Рыба", 460.0, 100.0, "Лещ хол.копч.", 2970.0, false },
                    { 513, 269.0, 0.0, "Рыба", 2050.0, 100.0, "Лосось соленый", 2100.0, false },
                    { 514, 124.0, 0.0, "Рыба", 360.0, 100.0, "Макрель", 2280.0, false },
                    { 515, 50.0, 0.0, "Рыба", 150.0, 100.0, "Мидии", 910.0, false },
                    { 516, 79.0, 0.0, "Рыба", 100.0, 100.0, "Минтай", 1760.0, false },
                    { 517, 92.0, 0.0, "Рыба", 70.0, 100.0, "Налим", 2140.0, false },
                    { 518, 170.0, 0.0, "Рыба", 1050.0, 100.0, "Нерка красная", 1880.0, false },
                    { 519, 112.0, 0.0, "Рыба", 360.0, 100.0, "Окунь морской", 1990.0, false },
                    { 520, 199.0, 0.0, "Рыба", 1040.0, 100.0, "Окунь морской (балычок)", 2640.0, false },
                    { 521, 175.0, 0.0, "Рыба", 900.0, 100.0, "Окунь морской гор.копч.", 2350.0, false },
                    { 522, 1077.0, 130.0, "Рыба", 330.0, 100.0, "Окунь морской тушка", 1820.0, false },
                    { 523, 821.0, 0.0, "Рыба", 90.0, 100.0, "Окунь речной филе", 1850.0, false },
                    { 524, 163.0, 60.0, "Рыба", 1060.0, 100.0, "Осетр", 1640.0, false },
                    { 525, 181.0, 340.0, "Рыба", 1200.0, 100.0, "Осетр в томатн.соусе", 1470.0, false },
                    { 526, 216.0, 0.0, "Рыба", 1780.0, 100.0, "Палтус", 1400.0, false },
                    { 527, 92.0, 0.0, "Рыба", 420.0, 100.0, "Паста Океан", 1360.0, false },
                    { 528, 613.0, 120.0, "Рыба", 6570.0, 100.0, "Печень трески", 420.0, false },
                    { 529, 145.0, 410.0, "Рыба", 870.0, 100.0, "Сазан в томатн.соусе", 1240.0, false },
                    { 530, 283.0, 0.0, "Рыба", 2330.0, 100.0, "Сайра бланшировання в масле", 1830.0, false },
                    { 531, 153.0, 0.0, "Рыба", 720.0, 100.0, "Салака", 2200.0, false },
                    { 532, 118.0, 340.0, "Рыба", 400.0, 100.0, "Салака в томатн.соусе", 1700.0, false },
                    { 533, 152.0, 0.0, "Рыба", 560.0, 100.0, "Салака гор.копч.", 2540.0, false },
                    { 534, 178.0, 0.0, "Рыба", 1080.0, 100.0, "Сардина", 2010.0, false },
                    { 535, 249.0, 0.0, "Рыба", 1970.0, 100.0, "Сардины (ломтики) в масле", 1790.0, false },
                    { 536, 179.0, 280.0, "Рыба", 1150.0, 100.0, "Севрюга в томатн.соусе", 1610.0, false },
                    { 537, 145.0, 0.0, "Рыба", 850.0, 100.0, "Сельдь атлантическая соленая", 1700.0, false },
                    { 538, 173.0, 0.0, "Рыба", 1140.0, 100.0, "Сельдь иваси соленая", 1750.0, false },
                    { 539, 225.0, 0.0, "Рыба", 1600.0, 100.0, "Сельдь тихоокеанская жирная хол.копч.", 2030.0, false },
                    { 540, 2025.0, 0.0, "Рыба", 1250.0, 100.0, "Семга соленая", 2250.0, false },
                    { 541, 1845.0, 0.0, "Рыба", 1050.0, 100.0, "Семга стейк мороженый", 2250.0, false },
                    { 542, 211.0, 0.0, "Рыба", 1470.0, 100.0, "Скумбрия", 1960.0, false },
                    { 543, 278.0, 0.0, "Рыба", 2510.0, 100.0, "Скумбрия в масле", 1310.0, false },
                    { 544, 150.0, 0.0, "Рыба", 640.0, 100.0, "Скумбрия хол.копч.", 2340.0, false },
                    { 545, 196.0, 0.0, "Рыба", 1360.0, 100.0, "Сом", 1840.0, false },
                    { 546, 126.0, 430.0, "Рыба", 630.0, 100.0, "Сом в томатн.соусе", 1290.0, false },
                    { 547, 133.0, 0.0, "Рыба", 560.0, 100.0, "Ставрида", 2060.0, false },
                    { 548, 110.0, 730.0, "Рыба", 230.0, 100.0, "Ставрида в томатн.соусе", 1480.0, false },
                    { 549, 309.0, 0.0, "Рыба", 2740.0, 100.0, "Ставрида обжаренная в масле", 1560.0, false },
                    { 550, 94.0, 0.0, "Рыба", 280.0, 100.0, "Ставрида хол.копч.", 1710.0, false },
                    { 551, 97.0, 0.0, "Рыба", 130.0, 100.0, "Судак", 2130.0, false },
                    { 552, 119.0, 370.0, "Рыба", 530.0, 100.0, "Судак в томатн.соусе", 1400.0, false },
                    { 553, 78.0, 0.0, "Рыба", 70.0, 100.0, "Треска", 1780.0, false },
                    { 554, 115.0, 0.0, "Рыба", 120.0, 100.0, "Треска гор.копч.", 2600.0, false },
                    { 555, 98.0, 0.0, "Рыба", 60.0, 100.0, "Треска соленая", 2310.0, false },
                    { 556, 96.0, 0.0, "Рыба", 70.0, 100.0, "Тунец", 2250.0, false },
                    { 557, 231.0, 0.0, "Рыба", 1590.0, 100.0, "Тунец в масле", 2200.0, false },
                    { 558, 225.0, 0.0, "Рыба", 1620.0, 100.0, "Тюлька соленая", 1980.0, false },
                    { 559, 166.0, 0.0, "Рыба", 900.0, 100.0, "Хамса соленая", 2120.0, false },
                    { 560, 95.0, 0.0, "Рыба", 230.0, 100.0, "Хек", 1850.0, false },
                    { 561, 563.0, 40.0, "Рыба", 3240.0, 100.0, "Шпроты", 1740.0, false },
                    { 562, 97.0, 0.0, "Рыба", 130.0, 100.0, "Щука", 2130.0, false },
                    { 563, 108.0, 360.0, "Рыба", 400.0, 100.0, "Щука в томатн.соусе", 1420.0, false },
                    { 564, 138.0, 0.0, "Рыба", 600.0, 100.0, "лосось (горбуша)", 2100.0, false },
                    { 565, 133.0, 0.0, "Рыба", 500.0, 100.0, "лосось (кета)", 2200.0, false },
                    { 566, 336.0, 600.0, "Рыба", 2800.0, 100.0, "осетр натуральный", 1500.0, false },
                    { 567, 99.0, 0.0, "Рыба", 60.0, 100.0, "тунец с соб. соку HEINZ", 2350.0, false },
                    { 568, 139.0, 0.0, "Рыба", 460.0, 100.0, "тунец стейк", 2440.0, false },
                    { 569, 94.0, 0.0, "Рыба", 190.0, 100.0, "угорь морск. г/к в/у (БИМ продукт)", 1910.0, false },
                    { 570, 88.0, 0.0, "Рыба", 200.0, 100.0, "форель свежая филе", 1750.0, false },
                    { 571, 5189.0, 5050.0, "Сладости", 3050.0, 100.0, "Батончики", 1060.0, false },
                    { 572, 263.0, 6870.0, "Сладости", 0.0, 100.0, "Варенье из айвы", 40.0, false },
                    { 573, 271.0, 7090.0, "Сладости", 0.0, 100.0, "Варенье из груш", 40.0, false },
                    { 574, 271.0, 7090.0, "Сладости", 0.0, 100.0, "Варенье из клубники", 30.0, false },
                    { 575, 275.0, 7120.0, "Сладости", 0.0, 100.0, "Варенье из малины", 60.0, false },
                    { 576, 278.0, 7230.0, "Сладости", 0.0, 100.0, "Варенье из мандаринов", 70.0, false },
                    { 577, 248.0, 6430.0, "Сладости", 0.0, 100.0, "Варенье из персиков", 50.0, false },
                    { 578, 281.0, 7340.0, "Сладости", 0.0, 100.0, "Варенье из сливы", 40.0, false },
                    { 579, 246.0, 6380.0, "Сладости", 0.0, 100.0, "Варенье из черноплодной рябины", 40.0, false },
                    { 580, 254.0, 6620.0, "Сладости", 0.0, 100.0, "Варенье из яблок", 40.0, false },
                    { 581, 275.0, 7120.0, "Сладости", 0.0, 100.0, "Варенье малиновое", 60.0, false },
                    { 582, 318.0, 4010.0, "Сладости", 1230.0, 100.0, "Ватрушка с творогом", 1060.0, false },
                    { 583, 435.0, 7650.0, "Сладости", 340.0, 100.0, "Вафли FLARONIS", 1340.0, false },
                    { 584, 539.0, 6470.0, "Сладости", 3020.0, 100.0, "Вафли с жиросодержащими начинками", 340.0, false },
                    { 585, 350.0, 8010.0, "Сладости", 280.0, 100.0, "Вафли с фруктовыми начинками", 320.0, false },
                    { 586, 382.0, 7200.0, "Сладости", 400.0, 100.0, "Воздушная кукуруза", 1300.0, false },
                    { 587, 415.0, 6840.0, "Сладости", 1020.0, 100.0, "Галеты", 920.0, false },
                    { 588, 391.0, 7560.0, "Сладости", 290.0, 100.0, "Гематоген", 610.0, false },
                    { 589, 265.0, 6880.0, "Сладости", 0.0, 100.0, "Джем из абрикосов", 50.0, false },
                    { 590, 259.0, 6780.0, "Сладости", 0.0, 100.0, "Джем из мандаринов", 30.0, false },
                    { 591, 265.0, 6820.0, "Сладости", 0.0, 100.0, "Джем из черной смородины", 60.0, false },
                    { 592, 552.0, 4100.0, "Сладости", 3830.0, 100.0, "Драже ореховое", 1190.0, false },
                    { 593, 374.0, 9800.0, "Сладости", 0.0, 100.0, "Драже сахарное", 0.0, false },
                    { 594, 389.0, 7310.0, "Сладости", 1020.0, 100.0, "Драже фруктово-ягодное в шоколаде", 570.0, false },
                    { 595, 2987.0, 7880.0, "Сладости", 0.0, 100.0, "Зефир", 80.0, false },
                    { 596, 395.0, 8180.0, "Сладости", 750.0, 100.0, "Ирис полутвердый", 330.0, false },
                    { 597, 400.0, 8350.0, "Сладости", 730.0, 100.0, "Ирис тираженный", 360.0, false },
                    { 598, 309.0, 5490.0, "Сладости", 750.0, 100.0, "Какао со сгущ. молоком с сахаром", 820.0, false },
                    { 599, 356.0, 4830.0, "Сладости", 1550.0, 100.0, "Какао со сгущ. сливками с сахаром", 820.0, false },
                    { 600, 370.0, 9570.0, "Сладости", 10.0, 100.0, "Карамель леденцовая", 0.0, false },
                    { 601, 358.0, 9260.0, "Сладости", 10.0, 100.0, "Карамель с ликерными начинками", 0.0, false },
                    { 602, 363.0, 9120.0, "Сладости", 100.0, 100.0, "Карамель с молочными начинками", 80.0, false },
                    { 603, 410.0, 8660.0, "Сладости", 730.0, 100.0, "Карамель с ореховыми начинками", 310.0, false },
                    { 604, 366.0, 9470.0, "Сладости", 10.0, 100.0, "Карамель с помадными начинками", 0.0, false },
                    { 605, 429.0, 8800.0, "Сладости", 1000.0, 100.0, "Карамель с прохладительными начинками", 0.0, false },
                    { 606, 357.0, 9210.0, "Сладости", 10.0, 100.0, "Карамель с фруктово-ягодными начинками", 10.0, false },
                    { 607, 420.0, 8610.0, "Сладости", 920.0, 100.0, "Карамель с шоколадно-ореховыми начинками", 180.0, false },
                    { 608, 531.0, 4860.0, "Сладости", 3540.0, 100.0, "Картофельные чипсы", 220.0, false },
                    { 609, 182.0, 3380.0, "Сладости", 220.0, 100.0, "Каштаны жареные", 320.0, false },
                    { 610, 547.0, 6020.0, "Сладости", 2860.0, 100.0, "Козинак кунжутный на фруктозе", 1220.0, false },
                    { 611, 512.0, 6460.0, "Сладости", 2690.0, 100.0, "Конфеты Грильяж (Рот-Фронт)", 510.0, false },
                    { 612, 526.0, 6050.0, "Сладости", 3210.0, 100.0, "Конфеты Мишка косолапый (Кр. октябрь)", 570.0, false },
                    { 613, 527.0, 5820.0, "Сладости", 3040.0, 100.0, "Конфеты Огни Москвы (Рот-Фронт)", 650.0, false },
                    { 614, 524.0, 4690.0, "Сладости", 3250.0, 100.0, "Конфеты Российские (Рот-Фронт)", 1220.0, false },
                    { 615, 562.0, 5500.0, "Сладости", 3500.0, 100.0, "Конфеты Трюфели с амаретто (Победа)", 500.0, false },
                    { 616, 3596.0, 5840.0, "Сладости", 1280.0, 100.0, "Конфеты Фруже клюква в желе и шок. (16гр/шт)", 270.0, false },
                    { 617, 364.0, 8230.0, "Сладости", 430.0, 100.0, "Конфеты молочные", 270.0, false },
                    { 618, 369.0, 8360.0, "Сладости", 460.0, 100.0, "Конфеты помадные", 220.0, false },
                    { 619, 346.0, 9060.0, "Сладости", 0.0, 100.0, "Конфеты фруктово-помадные", 0.0, false },
                    { 620, 510.0, 6440.0, "Сладости", 2690.0, 100.0, "Конфеты шоколадные с грильяжной начинкой", 530.0, false },
                    { 621, 523.0, 5360.0, "Сладости", 3180.0, 100.0, "Конфеты шоколадные с кремовой начинкой", 750.0, false },
                    { 622, 535.0, 5790.0, "Сладости", 3200.0, 100.0, "Конфеты шоколадные с начинкой между слоями вафель", 580.0, false },
                    { 623, 401.0, 7660.0, "Сладости", 1070.0, 100.0, "Конфеты шоколадные с помадной начинкой", 290.0, false },
                    { 624, 552.0, 5760.0, "Сладости", 3470.0, 100.0, "Конфеты шоколадные с пралиновой начинкой", 480.0, false },
                    { 625, 369.0, 7430.0, "Сладости", 860.0, 100.0, "Конфеты шоколадные с фруктовой начинкой", 160.0, false },
                    { 626, 569.0, 5130.0, "Сладости", 3950.0, 100.0, "Конфеты шоколадные с шоколадно-кремовой начинкой", 400.0, false },
                    { 627, 547.0, 5460.0, "Сладости", 3460.0, 100.0, "Конфеты шоколадные с шоколадно-ореховой начинкой", 640.0, false },
                    { 628, 439.0, 6610.0, "Сладости", 1410.0, 100.0, "Крекеры", 920.0, false },
                    { 629, 316.0, 7940.0, "Сладости", 70.0, 100.0, "Лукум сбивной", 80.0, false },
                    { 630, 293.0, 7600.0, "Сладости", 0.0, 100.0, "Мармелад фруктово-ягодный", 40.0, false },
                    { 631, 341.0, 2750.0, "Сладости", 2300.0, 100.0, "Масса творожная особая", 710.0, false },
                    { 632, 314.0, 8030.0, "Сладости", 0.0, 100.0, "Мед", 80.0, false },
                    { 633, 157.0, 70.0, "Сладости", 1150.0, 100.0, "Меланж", 1270.0, false },
                    { 634, 320.0, 5600.0, "Сладости", 850.0, 100.0, "Молоко сгущ. с сахаром", 720.0, false },
                    { 635, 1262.0, 2130.0, "Сладости", 350.0, 100.0, "Мороженое молочное", 370.0, false },
                    { 636, 134.0, 2310.0, "Сладости", 350.0, 100.0, "Мороженое молочное крем-брюле", 350.0, false },
                    { 637, 138.0, 2300.0, "Сладости", 350.0, 100.0, "Мороженое молочное шоколадное", 420.0, false },
                    { 638, 1776.0, 1940.0, "Сладости", 1000.0, 100.0, "Мороженое сливочное", 370.0, false },
                    { 639, 179.0, 1980.0, "Сладости", 1000.0, 100.0, "Мороженое сливочное", 330.0, false },
                    { 640, 186.0, 2160.0, "Сладости", 1000.0, 100.0, "Мороженое сливочное крем-брюле", 350.0, false },
                    { 641, 188.0, 2150.0, "Сладости", 1000.0, 100.0, "Мороженое сливочное шоколадное", 350.0, false },
                    { 642, 2988.0, 6260.0, "Сладости", 160.0, 100.0, "Мюсли \"Ягодная поляна\" (Фруктовница)", 850.0, false },
                    { 643, 147.0, 1900.0, "Сладости", 656.0, 100.0, "Мюсли Гренола яблочные с корицей", 300.0, false },
                    { 644, 310.0, 8040.0, "Сладости", 0.0, 100.0, "Пастила", 50.0, false },
                    { 645, 418.0, 7560.0, "Сладости", 880.0, 100.0, "Печенье затяжное", 830.0, false },
                    { 646, 436.0, 7440.0, "Сладости", 1180.0, 100.0, "Печенье сахарное", 750.0, false },
                    { 647, 458.0, 7680.0, "Сладости", 520.0, 100.0, "Печенье сдобное", 1040.0, false },
                    { 648, 284.0, 6100.0, "Сладости", 210.0, 100.0, "Пирог с повидлом", 530.0, false },
                    { 649, 351.0, 6420.0, "Сладости", 930.0, 100.0, "Пирожное бисквитное с фруктовой начинкой", 470.0, false },
                    { 650, 329.0, 5520.0, "Сладости", 1020.0, 100.0, "Пирожное заварное", 590.0, false },
                    { 651, 438.0, 5140.0, "Сладости", 2380.0, 100.0, "Пирожное крошковое", 610.0, false },
                    { 652, 435.0, 6260.0, "Сладости", 1850.0, 100.0, "Пирожное песочное с фруктовой начинкой", 510.0, false },
                    { 653, 555.0, 4640.0, "Сладости", 3860.0, 100.0, "Пирожное слоеное с кремом", 540.0, false },
                    { 654, 466.0, 5270.0, "Сладости", 2560.0, 100.0, "Пирожное слоеное с фруктовой начинкой", 570.0, false },
                    { 655, 227.0, 2080.0, "Сладости", 1500.0, 100.0, "Пломбир", 320.0, false },
                    { 656, 235.0, 2300.0, "Сладости", 1500.0, 100.0, "Пломбир крем-брюле", 300.0, false },
                    { 657, 236.0, 2230.0, "Сладости", 1500.0, 100.0, "Пломбир шоколадный", 360.0, false },
                    { 658, 336.0, 5590.0, "Сладости", 890.0, 100.0, "Плюшка московская", 760.0, false },
                    { 659, 240.0, 6000.0, "Сладости", 0.0, 100.0, "Повидло сливовое", 40.0, false },
                    { 660, 250.0, 6530.0, "Сладости", 0.0, 100.0, "Повидло яблочное", 40.0, false },
                    { 661, 296.0, 3880.0, "Сладости", 1300.0, 100.0, "Пончики", 560.0, false },
                    { 662, 350.0, 7770.0, "Сладости", 280.0, 100.0, "Пряники", 480.0, false },
                    { 663, 78.0, 1920.0, "Сладости", 10.0, 100.0, "Пюре яблочное", 60.0, false },
                    { 664, 314.0, 5720.0, "Сладости", 560.0, 100.0, "Рожки обсыпные", 780.0, false },
                    { 665, 379.0, 9980.0, "Сладости", 0.0, 100.0, "Сахар (песок)", 0.0, false },
                    { 666, 379.0, 9990.0, "Сладости", 0.0, 100.0, "Сахар-рафинад", 0.0, false },
                    { 667, 304.0, 5550.0, "Сладости", 520.0, 100.0, "Сдоба выборгская с маком", 750.0, false },
                    { 668, 293.0, 5710.0, "Сладости", 420.0, 100.0, "Сдоба выборгская с повидлом", 650.0, false },
                    { 669, 292.0, 5200.0, "Сладости", 530.0, 100.0, "Сдоба донская", 800.0, false },
                    { 670, 299.0, 5370.0, "Сладости", 530.0, 100.0, "Сдоба обыкновенная", 800.0, false },
                    { 671, 346.0, 2160.0, "Сладости", 2800.0, 100.0, "Сливки взбитые с ванилью", 280.0, false },
                    { 672, 382.0, 4700.0, "Сладости", 1900.0, 100.0, "Сливки сгущ. с сахаром", 800.0, false },
                    { 673, 373.0, 6920.0, "Сладости", 600.0, 100.0, "Соломка сладкая", 970.0, false },
                    { 674, 363.0, 6990.0, "Сладости", 550.0, 100.0, "Сухари с изюмом", 850.0, false },
                    { 675, 407.0, 3200.0, "Сладости", 2780.0, 100.0, "Сырки глазированные", 850.0, false },
                    { 676, 1538.0, 2870.0, "Сладости", 310.0, 100.0, "Творожный торт Ежевика (Морозный узор)", 280.0, false },
                    { 677, 2465.0, 3780.0, "Сладости", 890.0, 100.0, "Торт \"Мистер йогурт\" низкокалорийный", 380.0, false },
                    { 678, 391.0, 5880.0, "Сладости", 2000.0, 100.0, "Торт бисквитный с орехово-сливочным кремом", 560.0, false },
                    { 679, 356.0, 4980.0, "Сладости", 1180.0, 100.0, "Торт бисквитный с фруктовой начинкой", 470.0, false },
                    { 680, 335.0, 5360.0, "Сладости", 1240.0, 100.0, "Торт бисквитный с шоколадным кремом", 440.0, false },
                    { 681, 533.0, 4400.0, "Сладости", 3740.0, 100.0, "Торт слоеный с кремом", 500.0, false },
                    { 682, 289.0, 3950.0, "Сладости", 1270.0, 100.0, "Трюфель (Solo Italia)", 401.0, false },
                    { 683, 523.0, 5400.0, "Сладости", 2970.0, 100.0, "Халва подсолнечная ванильная", 1160.0, false },
                    { 684, 524.0, 4570.0, "Сладости", 3160.0, 100.0, "Халва тахинная Дружба", 1530.0, false },
                    { 685, 186.0, 3000.0, "Сладости", 600.0, 100.0, "Шарлотка", 350.0, false },
                    { 686, 535.0, 5460.0, "Сладости", 3200.0, 100.0, "Шоколад без добавлений", 710.0, false },
                    { 687, 613.0, 2370.0, "Сладости", 5300.0, 100.0, "Шоколад горький 87% \"Русский шоколад\"", 1040.0, false },
                    { 688, 544.0, 5310.0, "Сладости", 3450.0, 100.0, "Шоколад молочно-ореховый", 730.0, false },
                    { 689, 560.0, 5080.0, "Сладости", 3720.0, 100.0, "Шоколад молочно-сливочный", 760.0, false },
                    { 690, 550.0, 5240.0, "Сладости", 3570.0, 100.0, "Шоколад молочный", 690.0, false },
                    { 691, 549.0, 5230.0, "Сладости", 3550.0, 100.0, "Шоколад пористый молочный", 690.0, false },
                    { 692, 580.0, 4800.0, "Сладости", 4090.0, 100.0, "Шоколад с дробленым и целым орехом", 660.0, false },
                    { 693, 5215.0, 5520.0, "Сладости", 3070.0, 100.0, "Шоколад черный пористый \"Русский шоколад\"", 610.0, false },
                    { 694, 270.0, 1960.0, "Сладости", 2000.0, 100.0, "Эскимо", 350.0, false },
                    { 695, 264.0, 4020.0, "Сладости", 960.0, 100.0, "тирамису", 426.0, false },
                    { 696, 56.0, 1370.0, "Соки", 0.0, 100.0, "Абрикосовый сок", 50.0, false },
                    { 697, 45.0, 1040.0, "Соки", 0.0, 100.0, "Айвовый сок", 50.0, false },
                    { 698, 68.0, 1570.0, "Соки", 10.0, 100.0, "Ананасовый сок", 40.0, false },
                    { 699, 54.0, 1280.0, "Соки", 0.0, 100.0, "Апельсиновый сок", 70.0, false },
                    { 700, 54.0, 1380.0, "Соки", 0.0, 100.0, "Виноградный сок", 30.0, false },
                    { 701, 47.0, 1020.0, "Соки", 0.0, 100.0, "Вишневый сок", 70.0, false },
                    { 702, 64.0, 1450.0, "Соки", 0.0, 100.0, "Гранатовый сок", 30.0, false },
                    { 703, 36.0, 800.0, "Соки", 0.0, 100.0, "Грейпфрутовый сок", 30.0, false },
                    { 704, 26.0, 250.0, "Соки", 0.0, 100.0, "Лимонный сок", 60.0, false },
                    { 705, 43.0, 900.0, "Соки", 0.0, 100.0, "Мандариновый сок", 80.0, false },
                    { 706, 66.0, 1700.0, "Соки", 0.0, 100.0, "Персиковый сок", 30.0, false },
                    { 707, 66.0, 1610.0, "Соки", 0.0, 100.0, "Сливовый сок", 30.0, false },
                    { 708, 28.0, 580.0, "Соки", 10.0, 100.0, "Сок морковный", 110.0, false },
                    { 709, 42.0, 990.0, "Соки", 0.0, 100.0, "Сок свекольный", 100.0, false },
                    { 710, 19.0, 350.0, "Соки", 0.0, 100.0, "Сок томатный", 100.0, false },
                    { 711, 32.0, 740.0, "Соки", 0.0, 100.0, "Черноплодно-рябиновый сок", 10.0, false },
                    { 712, 40.0, 790.0, "Соки", 0.0, 100.0, "Черносмородинов.сок", 50.0, false },
                    { 713, 70.0, 1760.0, "Соки", 0.0, 100.0, "Шиповниковый сок", 10.0, false },
                    { 714, 38.0, 910.0, "Соки", 0.0, 100.0, "Яблочный сок", 50.0, false },
                    { 715, 164.0, 350.0, "Соки", 0.0, 100.0, "сок \"Перец красный\" (8 овощей)", 60.0, false },
                    { 716, 93.0, 880.0, "Супы", 530.0, 100.0, "Борщ из квашеной капусты", 250.0, false },
                    { 717, 97.0, 980.0, "Супы", 520.0, 100.0, "Борщ из свежей капусты с томатами", 260.0, false },
                    { 718, 49.0, 640.0, "Супы", 210.0, 100.0, "Борщ летний", 110.0, false },
                    { 719, 43.0, 520.0, "Супы", 210.0, 100.0, "Борщ с капустой и картофелем", 90.0, false },
                    { 720, 48.0, 680.0, "Супы", 150.0, 100.0, "Борщ сибирский", 190.0, false },
                    { 721, 49.0, 670.0, "Супы", 220.0, 100.0, "Борщ украинский", 110.0, false },
                    { 722, 4.0, 0.0, "Супы", 20.0, 100.0, "Бульон говяжий", 60.0, false },
                    { 723, 1.0, 3.0, "Супы", 0.0, 100.0, "Бульон грибной", 10.0, false },
                    { 724, 3.0, 0.0, "Супы", 10.0, 100.0, "Бульон куриный", 50.0, false },
                    { 725, 2.0, 0.0, "Супы", 4.0, 100.0, "Бульон рыбный", 40.0, false },
                    { 726, 46.0, 640.0, "Супы", 170.0, 100.0, "Рассольник домашний", 110.0, false },
                    { 727, 50.0, 720.0, "Супы", 180.0, 100.0, "Рассольник ленинградский", 120.0, false },
                    { 728, 98.0, 980.0, "Супы", 520.0, 100.0, "Свекольник", 290.0, false },
                    { 729, 49.0, 850.0, "Супы", 110.0, 100.0, "Суп картофельный", 110.0, false },
                    { 730, 54.0, 830.0, "Супы", 220.0, 100.0, "Суп картофельный с бобовыми", 260.0, false },
                    { 731, 41.0, 670.0, "Супы", 100.0, 100.0, "Суп картофельный с грибами", 100.0, false },
                    { 732, 54.0, 950.0, "Супы", 120.0, 100.0, "Суп картофельный с крупой", 130.0, false },
                    { 733, 48.0, 840.0, "Супы", 100.0, 100.0, "Суп картофельный с макаронными изделиями", 130.0, false },
                    { 734, 42.0, 480.0, "Супы", 210.0, 100.0, "Суп крестьянский", 100.0, false },
                    { 735, 38.0, 460.0, "Супы", 170.0, 100.0, "Суп овощной", 110.0, false },
                    { 736, 46.0, 520.0, "Супы", 210.0, 100.0, "Суп овощной с фасолью", 160.0, false },
                    { 737, 34.0, 520.0, "Супы", 110.0, 100.0, "Суп рисовый с мясом", 70.0, false },
                    { 738, 66.0, 140.0, "Супы", 220.0, 100.0, "Суп с бобовыми", 340.0, false },
                    { 739, 48.0, 590.0, "Супы", 210.0, 100.0, "Суп с макаронными изделиями", 140.0, false },
                    { 740, 46.0, 550.0, "Супы", 100.0, 100.0, "Уха", 340.0, false },
                    { 741, 32.0, 270.0, "Супы", 210.0, 100.0, "Щи из квашеной капусты с картофелем", 60.0, false },
                    { 742, 94.0, 900.0, "Супы", 530.0, 100.0, "Щи из свежей капусты", 260.0, false },
                    { 743, 31.0, 310.0, "Супы", 210.0, 100.0, "Щи из свежей капусты", 90.0, false },
                    { 744, 38.0, 380.0, "Супы", 210.0, 100.0, "Щи из свежей капусты с картофелем", 100.0, false },
                    { 745, 34.0, 150.0, "Супы", 280.0, 100.0, "Щи суточные", 60.0, false },
                    { 746, 234.0, 5500.0, "Сухофрукты", 0.0, 100.0, "Абрикосы сушеные без косточки (курага)", 520.0, false },
                    { 747, 227.0, 5300.0, "Сухофрукты", 0.0, 100.0, "Абрикосы сушеные с косточкой (урюк)", 500.0, false },
                    { 748, 390.0, 8050.0, "Сухофрукты", 180.0, 100.0, "Бананы сушеные", 390.0, false },
                    { 749, 262.0, 6600.0, "Сухофрукты", 0.0, 100.0, "Изюм", 180.0, false },
                    { 750, 238.0, 5320.0, "Сухофрукты", 120.0, 100.0, "Инжир сушеный", 310.0, false },
                    { 751, 234.0, 5500.0, "Сухофрукты", 0.0, 100.0, "Курага", 520.0, false },
                    { 752, 227.0, 5450.0, "Сухофрукты", 0.0, 100.0, "Персики сушеные (курага)", 300.0, false },
                    { 753, 306.0, 7230.0, "Сухофрукты", 50.0, 100.0, "Финики сушеные", 200.0, false },
                    { 754, 242.0, 5840.0, "Сухофрукты", 0.0, 100.0, "Чернослив", 230.0, false },
                    { 755, 110.0, 2150.0, "Сухофрукты", 0.0, 100.0, "Шиповник сушеный", 340.0, false },
                    { 756, 259.0, 6083.0, "Сухофрукты", 0.0, 100.0, "Яблоки сушеные", 228.0, false },
                    { 757, 2273.0, 0.0, "Сыры", 1770.0, 100.0, "Брынза Фетаки", 1700.0, false },
                    { 758, 260.0, 0.0, "Сыры", 2010.0, 100.0, "Брынза из коровьего молока", 1790.0, false },
                    { 759, 298.0, 0.0, "Сыры", 2550.0, 100.0, "Брынза из овечьего молока", 1460.0, false },
                    { 760, 2525.0, 0.0, "Сыры", 2010.0, 100.0, "Брынза коровья", 1790.0, false },
                    { 761, 340.0, 0.0, "Сыры", 2700.0, 100.0, "Российский плавленый сыр", 2200.0, false },
                    { 762, 285.0, 0.0, "Сыры", 2200.0, 100.0, "Сулугуни", 1950.0, false },
                    { 763, 220.0, 100.0, "Сыры", 1000.0, 100.0, "Сыр \"Вест\" 10% (Швейцарский)", 3100.0, false },
                    { 764, 281.0, 100.0, "Сыры", 1700.0, 100.0, "Сыр \"Хит\" 17% (Польша)", 3100.0, false },
                    { 765, 353.0, 300.0, "Сыры", 3500.0, 100.0, "Сыр Маскарпоне (IGOR)", 650.0, false },
                    { 766, 265.0, 100.0, "Сыры", 2100.0, 100.0, "Сыр Моццарелла Cilieqine (Феномен-ХХ)", 1800.0, false },
                    { 767, 262.0, 150.0, "Сыры", 2000.0, 100.0, "Сыр Моццарелла Santa Lucia (Galbani)", 1900.0, false },
                    { 768, 273.0, 0.0, "Сыры", 1700.0, 100.0, "Сыр Ольтерманни 17% (Валио)", 3000.0, false },
                    { 769, 397.0, 0.0, "Сыры", 3300.0, 100.0, "Сыр Ольтерманни 33% (Валио)", 2500.0, false },
                    { 770, 408.0, 322.0, "Сыры", 2800.0, 100.0, "Сыр Старый голландец", 3575.0, false },
                    { 771, 285.0, 0.0, "Сыры", 2200.0, 100.0, "Сыр Сулугуни", 1950.0, false },
                    { 772, 256.0, 240.0, "Сыры", 1880.0, 100.0, "Сыр Сулугуни (Умалат)", 1950.0, false },
                    { 773, 302.0, 0.0, "Сыры", 2200.0, 100.0, "Сыр Эдамский (Hofmeister)", 2600.0, false },
                    { 774, 308.0, 230.0, "Сыры", 2250.0, 100.0, "Сыр балыковый копченый", 2260.0, false },
                    { 775, 352.0, 0.0, "Сыры", 2680.0, 100.0, "Сыр голландский брусковый", 2600.0, false },
                    { 776, 377.0, 0.0, "Сыры", 3050.0, 100.0, "Сыр голландский круглый", 2370.0, false },
                    { 777, 1143.0, 180.0, "Сыры", 400.0, 100.0, "Сыр домашний 4% (Карат)", 1700.0, false },
                    { 778, 310.0, 0.0, "Сыры", 2640.0, 100.0, "Сыр копченый к пиву", 1800.0, false },
                    { 779, 345.0, 0.0, "Сыры", 2630.0, 100.0, "Сыр костромской", 2520.0, false },
                    { 780, 319.0, 0.0, "Сыры", 2430.0, 100.0, "Сыр латвийский", 2320.0, false },
                    { 781, 392.0, 322.0, "Сыры", 2583.0, 100.0, "Сыр пармезан", 3575.0, false },
                    { 782, 264.0, 650.0, "Сыры", 2200.0, 100.0, "Сыр плавленый President", 1000.0, false },
                    { 783, 205.0, 0.0, "Сыры", 1260.0, 100.0, "Сыр плавленый Городской (Карат)", 2290.0, false },
                    { 784, 270.0, 0.0, "Сыры", 1900.0, 100.0, "Сыр плавленый Колбасный копченый", 2300.0, false },
                    { 785, 271.0, 0.0, "Сыры", 2000.0, 100.0, "Сыр плавленый Костромской", 2050.0, false },
                    { 786, 271.0, 0.0, "Сыры", 2000.0, 100.0, "Сыр плавленый Латвийский", 2050.0, false },
                    { 787, 302.0, 0.0, "Сыры", 2250.0, 100.0, "Сыр плавленый Советский", 2300.0, false },
                    { 788, 350.0, 0.0, "Сыры", 2650.0, 100.0, "Сыр пошехонский", 2600.0, false },
                    { 789, 209.0, 0.0, "Сыры", 900.0, 100.0, "Сыр прибалтийский", 3000.0, false },
                    { 790, 337.0, 0.0, "Сыры", 2800.0, 100.0, "Сыр рокфор", 2000.0, false },
                    { 791, 360.0, 0.0, "Сыры", 2900.0, 100.0, "Сыр российский", 2300.0, false },
                    { 792, 389.0, 0.0, "Сыры", 3120.0, 100.0, "Сыр советский", 2470.0, false },
                    { 793, 250.0, 0.0, "Сыры", 2000.0, 100.0, "Сыр сулугуни копч. (сыр-лапша, ж - 20%)", 2100.0, false },
                    { 794, 379.0, 0.0, "Сыры", 3050.0, 100.0, "Сыр чеддер", 2350.0, false },
                    { 795, 396.0, 0.0, "Сыры", 3180.0, 100.0, "Сыр швейцарский", 2490.0, false },
                    { 796, 350.0, 0.0, "Сыры", 2640.0, 100.0, "Сыр эстонский", 2600.0, false },
                    { 797, 361.0, 0.0, "Сыры", 2730.0, 100.0, "Сыр ярославский", 2680.0, false },
                    { 798, 232.0, 280.0, "Творог", 1800.0, 100.0, "Творог жирный 18%", 1400.0, false },
                    { 799, 159.0, 200.0, "Творог", 900.0, 100.0, "Творог жирный 9%", 1670.0, false },
                    { 800, 88.0, 180.0, "Творог", 60.0, 100.0, "Творог нежирный", 1800.0, false },
                    { 801, 115.0, 150.0, "Творог", 200.0, 100.0, "Творог столовый 2% жирн.", 1700.0, false },
                    { 802, 79.0, 180.0, "Творог", 0.0, 100.0, "творог 0% (домик в деревне)", 1700.0, false },
                    { 803, 79.0, 160.0, "Творог", 0.0, 100.0, "творог 33 коровы 0%", 1800.0, false },
                    { 804, 104.0, 100.0, "Творог", 400.0, 100.0, "творог 33 коровы 4%", 1500.0, false },
                    { 805, 1128.0, 120.0, "Творог", 400.0, 100.0, "творог Домашний 4%", 1800.0, false },
                    { 806, 768.0, 120.0, "Творог", 0.0, 100.0, "творог Хуторок нежирный", 1800.0, false },
                    { 807, 70.0, 280.0, "Творог", 80.0, 100.0, "творог взбитый 0.8% (Веселый молочник)", 1200.0, false },
                    { 808, 846.0, 180.0, "Творог", 60.0, 100.0, "творог нежирный \"Славянский\" из Вологды", 1800.0, false },
                    { 809, 78.0, 150.0, "Творог", 0.0, 100.0, "творог нежирный останкинский", 1800.0, false },
                    { 810, 792.0, 350.0, "Творог", 0.0, 100.0, "творог обезжиренный Svalia", 1630.0, false },
                    { 811, 41.0, 900.0, "Фрукты", 10.0, 100.0, "Абрикосы", 90.0, false },
                    { 812, 40.0, 790.0, "Фрукты", 50.0, 100.0, "Айва", 60.0, false },
                    { 813, 27.0, 640.0, "Фрукты", 0.0, 100.0, "Алыча", 20.0, false },
                    { 814, 465.0, 1150.0, "Фрукты", 20.0, 100.0, "Ананас", 40.0, false },
                    { 815, 40.0, 810.0, "Фрукты", 20.0, 100.0, "Апельсин", 90.0, false },
                    { 816, 38.0, 880.0, "Фрукты", 20.0, 100.0, "Арбуз", 70.0, false },
                    { 817, 893.0, 2100.0, "Фрукты", 50.0, 100.0, "Банан", 150.0, false },
                    { 818, 65.0, 1500.0, "Фрукты", 20.0, 100.0, "Виноград", 60.0, false },
                    { 819, 626.0, 1450.0, "Фрукты", 60.0, 100.0, "Гранат", 70.0, false },
                    { 820, 314.0, 650.0, "Фрукты", 20.0, 100.0, "Грейпфрут", 90.0, false },
                    { 821, 42.0, 950.0, "Фрукты", 30.0, 100.0, "Груша", 40.0, false },
                    { 822, 57.0, 0.0, "Фрукты", 60.0, 100.0, "Гуава", 80.0, false },
                    { 823, 38.0, 910.0, "Фрукты", 0.0, 100.0, "Дыня", 60.0, false },
                    { 824, 49.0, 1200.0, "Фрукты", 20.0, 100.0, "Инжир", 70.0, false },
                    { 825, 51.0, 400.0, "Фрукты", 60.0, 100.0, "Киви", 100.0, false },
                    { 826, 16.0, 300.0, "Фрукты", 10.0, 100.0, "Лимон", 90.0, false },
                    { 827, 67.0, 1150.0, "Фрукты", 27.0, 100.0, "Манго", 50.0, false },
                    { 828, 331.0, 750.0, "Фрукты", 20.0, 100.0, "Мандарин", 80.0, false },
                    { 829, 48.0, 920.0, "Фрукты", 10.0, 100.0, "Папайя", 60.0, false },
                    { 830, 43.0, 950.0, "Фрукты", 10.0, 100.0, "Персики", 90.0, false },
                    { 831, 43.0, 960.0, "Фрукты", 0.0, 100.0, "Слива садовая", 80.0, false },
                    { 832, 63.0, 1530.0, "Фрукты", 40.0, 100.0, "Хурма", 50.0, false },
                    { 833, 37.0, 800.0, "Фрукты", 36.0, 100.0, "Яблоки", 20.0, false },
                    { 834, 262.0, 4980.0, "Хлеб", 300.0, 100.0, "Батон нарезной", 770.0, false },
                    { 835, 235.0, 4890.0, "Хлеб", 90.0, 100.0, "Батон простой", 800.0, false },
                    { 836, 284.0, 4940.0, "Хлеб", 560.0, 100.0, "Батон столовый", 760.0, false },
                    { 837, 273.0, 5140.0, "Хлеб", 280.0, 100.0, "Батончик с отрубями", 920.0, false },
                    { 838, 369.0, 6210.0, "Хлеб", 760.0, 100.0, "Белый хлеб хрустящий", 1000.0, false },
                    { 839, 277.0, 5600.0, "Хлеб", 110.0, 100.0, "Лаваш", 910.0, false },
                    { 840, 2575.0, 3970.0, "Хлеб", 510.0, 100.0, "Хлеб \"8 злаков\" (ЩелковоХлеб)", 1320.0, false },
                    { 841, 253.0, 5030.0, "Хлеб", 120.0, 100.0, "Хлеб \"Аромат\"", 930.0, false },
                    { 842, 1796.0, 3010.0, "Хлеб", 240.0, 100.0, "Хлеб \"Довольство\" (кориандр и солод)", 940.0, false },
                    { 843, 1743.0, 3160.0, "Хлеб", 110.0, 100.0, "Хлеб \"Довольство\" (с яблочной подваркой)", 950.0, false },
                    { 844, 213.0, 4170.0, "Хлеб", 120.0, 100.0, "Хлеб \"Куликовский\"", 760.0, false },
                    { 845, 203.0, 3790.0, "Хлеб", 180.0, 100.0, "Хлеб Здоровье", 790.0, false },
                    { 846, 216.0, 1130.0, "Хлеб", 340.0, 100.0, "Хлеб белково-отрубевой", 2350.0, false },
                    { 847, 2136.0, 4670.0, "Хлеб", 90.0, 100.0, "Хлеб белый батон нарезной", 760.0, false },
                    { 848, 207.0, 4070.0, "Хлеб", 130.0, 100.0, "Хлеб бородинский", 680.0, false },
                    { 849, 247.0, 4660.0, "Хлеб", 260.0, 100.0, "Хлеб докторский", 820.0, false },
                    { 850, 228.0, 4390.0, "Хлеб", 140.0, 100.0, "Хлеб зерновой", 860.0, false },
                    { 851, 203.0, 3790.0, "Хлеб", 180.0, 100.0, "Хлеб пониженной калорийности", 790.0, false },
                    { 852, 238.0, 4860.0, "Хлеб", 80.0, 100.0, "Хлеб пшеничный из муки высшего сорта", 760.0, false },
                    { 853, 209.0, 3870.0, "Хлеб", 150.0, 100.0, "Хлеб пшеничный подовый", 870.0, false },
                    { 854, 195.0, 3610.0, "Хлеб", 140.0, 100.0, "Хлеб пшеничный формовой", 820.0, false },
                    { 855, 195.0, 3720.0, "Хлеб", 130.0, 100.0, "Хлеб ржаной московский", 700.0, false },
                    { 856, 206.0, 4090.0, "Хлеб", 120.0, 100.0, "Хлеб ржаной подовый", 610.0, false },
                    { 857, 181.0, 3420.0, "Хлеб", 120.0, 100.0, "Хлеб ржаной формовой", 660.0, false },
                    { 858, 291.0, 5580.0, "Хлеб", 230.0, 100.0, "Хлеб ржаной хрустящий", 1040.0, false },
                    { 859, 179.0, 3270.0, "Хлеб", 280.0, 100.0, "Хлеб с семенами подсолнечника (delba)", 570.0, false },
                    { 860, 212.0, 4190.0, "Хлеб", 120.0, 100.0, "Хлеб украинский подовый", 670.0, false },
                    { 861, 200.0, 3860.0, "Хлеб", 130.0, 100.0, "Хлеб украинский формовой", 690.0, false },
                    { 862, 401.0, 820.0, "Ягоды", 50.0, 100.0, "Брусника", 70.0, false },
                    { 863, 52.0, 1030.0, "Ягоды", 50.0, 100.0, "Вишня", 80.0, false },
                    { 864, 3487.0, 785.0, "Ягоды", 3.0, 100.0, "Вишня кислая (морож.)", 80.0, false },
                    { 865, 22.0, 580.0, "Ягоды", 0.0, 100.0, "Голубика", 110.0, false },
                    { 866, 31.0, 460.0, "Ягоды", 0.0, 100.0, "Ежевика", 210.0, false },
                    { 867, 368.0, 750.0, "Ягоды", 40.0, 100.0, "Земляника садовая", 80.0, false },
                    { 868, 41.0, 910.0, "Ягоды", 20.0, 100.0, "Крыжовник", 70.0, false },
                    { 869, 42.0, 830.0, "Ягоды", 30.0, 100.0, "Малина", 80.0, false },
                    { 870, 28.0, 600.0, "Ягоды", 0.0, 100.0, "Морошка", 80.0, false },
                    { 871, 52.0, 500.0, "Ягоды", 250.0, 100.0, "Облепиха", 90.0, false },
                    { 872, 46.0, 860.0, "Ягоды", 10.0, 100.0, "Рябина садовая", 140.0, false },
                    { 873, 52.0, 1090.0, "Ягоды", 10.0, 100.0, "Рябина черноплодная", 150.0, false },
                    { 874, 38.0, 800.0, "Ягоды", 0.0, 100.0, "Смородина белая", 30.0, false },
                    { 875, 39.0, 730.0, "Ягоды", 20.0, 100.0, "Смородина красная", 60.0, false },
                    { 876, 368.0, 730.0, "Ягоды", 40.0, 100.0, "Смородина черная", 100.0, false },
                    { 877, 344.0, 770.0, "Ягоды", 0.0, 100.0, "Фруктовая смесь \"4 сезона\"", 90.0, false },
                    { 878, 50.0, 1200.0, "Ягоды", 0.0, 100.0, "Шелковица", 70.0, false },
                    { 879, 51.0, 1000.0, "Ягоды", 0.0, 100.0, "Шиповник свежий", 160.0, false },
                    { 880, 172.0, 380.0, "Ягоды", 0.0, 100.0, "клюква", 50.0, false },
                    { 881, 504.0, 1060.0, "Ягоды", 40.0, 100.0, "черешня", 110.0, false },
                    { 882, 476.0, 1000.0, "Ягоды", 0.0, 100.0, "черника", 190.0, false },
                    { 883, 184.0, 190.0, "Яйца", 1540.0, 100.0, "Омлет", 960.0, false },
                    { 884, 375.0, 720.0, "Яйца", 180.0, 100.0, "Сухой белок", 8240.0, false },
                    { 885, 613.0, 470.0, "Яйца", 5220.0, 100.0, "Сухой желток", 5110.0, false },
                    { 886, 243.0, 90.0, "Яйца", 2090.0, 100.0, "Яичница-глазунья", 1290.0, false },
                    { 887, 50.0, 103.0, "Яйца", 0.0, 100.0, "Яичный белок", 1052.0, false },
                    { 888, 358.0, 178.0, "Яйца", 3087.0, 100.0, "Яичный желток", 1676.0, false },
                    { 889, 542.0, 450.0, "Яйца", 3730.0, 100.0, "Яичный порошок", 4600.0, false },
                    { 890, 160.0, 80.0, "Яйца", 1160.0, 100.0, "Яйца куриные вареные вкрутую", 1300.0, false },
                    { 891, 159.0, 80.0, "Яйца", 1160.0, 100.0, "Яйца куриные вареные всмятку", 1280.0, false },
                    { 892, 157.0, 70.0, "Яйца", 1150.0, 100.0, "Яйца куриные сырые", 1270.0, false }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 230);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 231);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 232);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 233);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 234);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 235);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 236);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 237);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 238);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 239);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 240);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 241);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 242);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 243);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 244);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 245);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 246);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 247);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 248);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 249);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 250);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 251);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 252);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 253);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 254);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 255);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 256);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 257);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 258);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 259);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 260);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 261);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 262);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 263);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 264);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 265);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 266);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 267);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 268);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 269);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 270);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 271);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 272);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 273);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 274);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 275);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 276);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 277);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 278);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 279);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 280);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 281);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 282);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 283);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 284);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 285);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 286);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 287);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 288);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 289);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 290);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 291);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 292);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 293);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 294);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 295);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 296);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 297);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 298);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 299);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 300);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 301);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 302);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 303);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 304);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 305);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 306);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 307);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 308);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 309);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 310);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 311);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 312);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 313);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 314);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 315);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 316);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 317);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 318);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 319);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 320);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 321);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 322);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 323);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 324);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 325);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 326);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 327);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 328);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 329);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 330);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 331);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 332);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 333);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 334);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 335);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 336);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 337);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 338);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 339);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 340);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 341);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 342);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 343);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 344);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 345);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 346);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 347);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 348);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 349);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 350);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 351);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 352);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 353);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 354);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 355);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 356);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 357);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 358);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 359);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 360);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 361);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 362);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 363);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 364);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 365);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 366);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 367);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 368);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 369);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 370);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 371);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 372);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 373);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 374);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 375);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 376);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 377);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 378);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 379);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 380);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 381);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 382);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 383);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 384);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 385);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 386);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 387);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 388);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 389);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 390);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 391);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 392);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 393);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 394);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 395);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 396);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 397);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 398);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 399);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 400);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 401);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 402);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 403);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 404);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 405);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 406);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 407);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 408);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 409);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 410);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 411);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 412);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 413);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 414);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 415);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 416);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 417);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 418);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 419);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 420);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 421);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 422);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 423);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 424);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 425);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 426);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 427);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 428);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 429);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 430);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 431);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 432);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 433);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 434);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 435);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 436);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 437);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 438);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 439);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 440);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 441);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 442);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 443);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 444);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 445);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 446);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 447);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 448);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 449);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 450);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 451);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 452);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 453);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 454);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 455);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 456);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 457);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 458);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 459);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 460);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 461);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 462);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 463);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 464);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 465);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 466);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 467);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 468);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 469);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 470);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 471);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 472);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 473);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 474);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 475);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 476);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 477);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 478);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 479);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 480);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 481);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 482);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 483);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 484);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 485);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 486);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 487);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 488);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 489);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 490);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 491);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 492);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 493);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 494);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 495);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 496);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 497);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 498);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 499);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 500);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 501);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 502);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 503);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 504);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 505);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 506);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 507);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 508);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 509);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 510);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 511);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 512);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 513);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 514);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 515);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 516);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 517);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 518);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 519);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 520);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 521);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 522);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 523);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 524);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 525);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 526);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 527);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 528);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 529);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 530);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 531);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 532);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 533);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 534);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 535);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 536);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 537);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 538);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 539);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 540);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 541);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 542);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 543);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 544);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 545);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 546);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 547);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 548);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 549);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 550);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 551);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 552);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 553);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 554);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 555);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 556);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 557);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 558);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 559);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 560);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 561);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 562);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 563);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 564);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 565);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 566);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 567);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 568);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 569);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 570);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 571);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 572);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 573);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 574);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 575);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 576);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 577);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 578);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 579);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 580);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 581);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 582);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 583);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 584);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 585);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 586);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 587);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 588);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 589);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 590);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 591);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 592);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 593);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 594);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 595);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 596);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 597);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 598);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 599);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 600);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 601);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 602);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 603);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 604);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 605);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 606);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 607);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 608);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 609);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 610);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 611);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 612);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 613);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 614);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 615);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 616);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 617);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 618);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 619);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 620);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 621);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 622);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 623);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 624);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 625);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 626);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 627);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 628);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 629);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 630);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 631);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 632);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 633);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 634);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 635);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 636);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 637);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 638);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 639);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 640);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 641);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 642);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 643);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 644);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 645);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 646);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 647);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 648);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 649);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 650);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 651);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 652);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 653);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 654);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 655);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 656);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 657);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 658);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 659);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 660);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 661);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 662);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 663);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 664);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 665);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 666);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 667);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 668);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 669);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 670);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 671);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 672);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 673);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 674);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 675);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 676);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 677);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 678);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 679);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 680);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 681);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 682);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 683);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 684);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 685);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 686);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 687);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 688);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 689);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 690);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 691);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 692);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 693);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 694);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 695);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 696);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 697);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 698);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 699);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 700);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 701);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 702);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 703);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 704);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 705);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 706);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 707);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 708);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 709);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 710);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 711);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 712);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 713);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 714);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 715);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 716);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 717);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 718);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 719);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 720);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 721);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 722);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 723);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 724);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 725);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 726);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 727);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 728);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 729);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 730);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 731);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 732);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 733);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 734);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 735);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 736);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 737);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 738);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 739);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 740);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 741);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 742);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 743);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 744);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 745);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 746);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 747);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 748);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 749);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 750);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 751);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 752);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 753);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 754);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 755);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 756);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 757);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 758);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 759);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 760);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 761);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 762);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 763);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 764);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 765);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 766);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 767);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 768);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 769);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 770);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 771);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 772);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 773);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 774);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 775);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 776);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 777);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 778);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 779);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 780);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 781);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 782);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 783);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 784);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 785);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 786);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 787);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 788);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 789);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 790);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 791);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 792);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 793);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 794);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 795);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 796);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 797);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 798);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 799);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 800);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 801);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 802);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 803);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 804);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 805);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 806);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 807);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 808);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 809);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 810);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 811);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 812);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 813);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 814);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 815);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 816);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 817);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 818);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 819);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 820);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 821);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 822);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 823);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 824);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 825);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 826);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 827);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 828);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 829);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 830);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 831);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 832);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 833);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 834);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 835);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 836);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 837);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 838);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 839);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 840);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 841);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 842);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 843);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 844);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 845);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 846);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 847);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 848);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 849);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 850);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 851);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 852);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 853);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 854);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 855);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 856);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 857);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 858);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 859);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 860);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 861);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 862);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 863);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 864);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 865);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 866);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 867);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 868);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 869);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 870);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 871);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 872);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 873);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 874);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 875);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 876);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 877);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 878);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 879);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 880);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 881);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 882);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 883);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 884);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 885);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 886);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 887);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 888);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 889);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 890);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 891);

            migrationBuilder.DeleteData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 892);

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 1,
                column: "Carbs",
                value: 0.5);

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 2,
                column: "Carbs",
                value: 15.9);

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 3,
                columns: new[] { "Calories", "Carbs" },
                values: new object[] { 78.0, 4.5 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 4,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 223.0, 23.199999999999999, "Готовые блюда", 10.0, "Беляши", 11.0 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 5,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 640.0, 55.200000000000003, "Готовые блюда", 33.100000000000001, "Блинчики с творогом и сметаной", 25.800000000000001 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 6,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 23.0, 1.1000000000000001, "Грибы", 1.7, "Белые грибы", 3.7000000000000002 });

            migrationBuilder.UpdateData(
                table: "Products",
                keyColumn: "Id",
                keyValue: 7,
                columns: new[] { "Calories", "Carbs", "CategoryName", "Fats", "Name", "Protein" },
                values: new object[] { 152.0, 7.5999999999999996, "Грибы", 4.7999999999999998, "Белые грибы сушеные", 20.100000000000001 });
        }
    }
}
